[{
  "_id": {
    "$oid": "61fbcb7464283b6744a4ec0c"
  },
  "companiesRejectedFrom": [
    "Fulbright",
    "Boren fellowship",
    "Global health corps",
    "Princeton in latin america (semifinalist)",
    "Humanity in action",
    "Payne fellowship (finalist)",
    "Gruber fellowship in global justice and women's rights",
    "Penn president's engagement prize (finalist)",
    "Foreign service (did not receive an interview until my 3rd try)",
    "Consular fellows program",
    "Point foundation scholarship",
    "Hispanic scholarship fund scholarship"
  ],
  "thingIsworeIdFinish": [
    "Learning how to cook",
    "Playing piano",
    "Read the majority of books on my book shelf",
    "Watch every scandal and htgawm season on netflix",
    "Learning how to tango",
    "My pre-med requirements",
    "My memoir"
  ],
  "everydayLs": [],
  "memoriesImade": [
    "Taking a four day boat cruise from bali to komodo island like life of pi",
    "Ignoring tlc's advice and chasing waterfalls in indonesia",
    "Reconnecting with my native hawaiian roots",
    "Dancing in the rain near the penn vet campus",
    "Spring fling (all of it)",
    "Taking a spontaneous trip to toronto during fall break",
    "Discovering the magic of ru paul's drag race",
    "Being the man of honor at my best friend's wedding",
    "Being a good uncle"
  ],
  "thingsLearnt": [],
  "booksForFun": [
    "The alchemist by Paulo Coelho",
    "How democracies die by Steven Levitsky and Daniel Ziblatt",
    "A little life by Hanya Yanagihara",
    "The 7 habits of highly effective people by Stephen Covey",
    "On earth we're briefly gorgeous by Ocean Vuong",
    "The velvet rage by Alan Downs",
    "Everything happens for a reason and other lies I've loved by Kate Bowler",
    "Educated by tara westover",
    "Becoming by Michelle Obama",
    "Sapiens by yuval noah harari",
    "Invisible cities by Italo Calvino",
    "The wisdom of insecurity: a message for an age of anxiety by Alan Watts",
    "Grit: the power of passion and perseverance by Angela Duckworth"
  ],
  "thingsProudOf": [],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [
    "Getting appendicitis in Indonesia",
    "Not getting enough funding and dropping my MPh program at Yale",
    "Having dim sum with us consul general Hanscom Smith",
    "Falling in love",
    "Witnessing the 2019 hong kong protests"
  ],
  "quirks": [],
  "comfortZone": [
    "Write an op-ed for the dp to bring awareness to issues affecting low-income students",
    "Teach english to catholic seminarians in Vietnam",
    "Compete in a Bahasa Indonesia competition at Cornell university",
    "Run for the Yale graduate and professional student senate"
  ],
  "endOfTheWorld": [],
  "leapsOfFaith": [
    "Moving to Indonesia",
    "Studying a masters that was 'impractical'",
    "Changing career paths by letting go of my parents' pre-med dream",
    "Coming out",
    "Moving to hong kong"
  ],
  "advice": [
    "It's okay to not be productive every once in a while",
    "Don't give into the 'duck syndrome'",
    "Be mindful and slow down",
    "Never compare yourself - every one is on their own journey",
    "Embrace yourself wholly and unapologetically"
  ],
  "email": "sean.massa@aya.yale.edu",
  "name": "Sean Massa",
  "class": "2015",
  "type": "curf",
  "shortBio": "At Penn, I majored in Health and Societies with a Global Health concentration and minored in Philosophy. I graduated from the College in 2015. Since Penn, I spent a year teaching in Indonesia on a Princeton in Asia fellowship, had 2 internships with the UN in Indonesia (UN Information Centre and UNHCR), obtained a masters in Ethics and Religion at Yale, completed a Yale-China internship, and moved to Hong Kong where I currently work as an education consultant and am completing an LLM in Human Rights Law at the University of Hong Kong. I recently received a 2022 Rangel Graduate Fellowship, which will prepare me for a career with the Department of State as a Foreign Service Officer. ",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Sean+Massa+-+headshot+-+Sean+Massa.JPG"
},
{
  "_id": {
    "$oid": "61fbc7114e4431632f7a36ca"
  },
  "companiesRejectedFrom": [
    "Rhodes scholarship",
    "Truman scholarship",
    "Marshall scholarship",
    "White house ceq",
    "Nasa sarp",
    "White house cea",
    "Too many senatoral/congressional offices to count",
    "Purm",
    "Perry world house fellows x2."
  ],
  "thingIsworeIdFinish": [
    "A fiction novel I started in high school",
    "Learning Hindi",
    "Running that marathon",
    "Learning how to ski backwards."
  ],
  "everydayLs": [
    "Always forgetting where I put stuff",
    "Never waking up on time",
    "Leaving my mic on while sleeping in zoom class",
    "Having no sense of fashion whatsoever",
    "Still not knowing how to code at all."
  ],
  "memoriesImade": [
    "Spontaneous airplane trips",
    "Happy hour jumping",
    "Skiing trips with friends",
    "3:00 am river walks",
    "Writing sem lunches."
  ],
  "thingsLearnt": [
    "Finding cheap plane tickets take patiences and vigilance",
    "More pizza toppings =/= better."
  ],
  "booksForFun": [],
  "thingsProudOf": [
    "Getting really good at making pizza",
    "Self-teaching myself conversational spanish",
    "Being able to name almost all 100 senators",
    "I am pretty good at pokemon trainer in smash"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [
    "Getting tight with the people in my writing sem",
    "Working at the epa for 2 years",
    "Working at the state department for 1.5 years",
    "Going vegetarian",
    "Giving tours at the philadelphia zoo."
  ],
  "quirks": [],
  "comfortZone": [
    "Spending an hour every day just sitting in the subway for 3 years",
    "Getting my diving certification",
    "Going vegetarian for most of college."
  ],
  "endOfTheWorld": [
    "Not winning the Truman scholarship",
    "Dropping chem 242 the first time I took it",
    "Getting my White House internship rescinded because of covid and then proceeding to get rejected every single time I reapplied."
  ],
  "leapsOfFaith": [],
  "advice": [
    "Sometimes it's ok to take a break",
    "You define your own definition of success",
    "Everything works out and happens for a reason",
    "You need sleep",
    "Reach out more."
  ],
  "email": "jonszeto@sas.upenn.edu",
  "name": "Jonathan Szeto",
  "class": "2022",
  "type": "curf",
  "shortBio": "Jonathan is majoring in Earth Science and Political Science in the College of Arts and Science and will be graduating in May of 2022.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Headshot%20-%20Jonathan%20Szeto.jpg"
},
{
  "_id": {
    "$oid": "61fbca7964283b6744a4ec0b"
  },
  "companiesRejectedFrom": [
    "Soros fellowship",
    "Goldwater fellowship (twice)",
    "Samuel huntington",
    "Project heal case manager (eating disorder related nonprofit)",
    "Pixorize health content developer (pre-health prep company)"
  ],
  "thingIsworeIdFinish": [],
  "everydayLs": [
    "Locking yourself out of your dorm room and having to get a temporary penn card in your shower flip flops and robe",
    "Being really bad at responding to text messages",
    "Enjoying playing chess but losing every game"
  ],
  "memoriesImade": [
    "Going to the biomed library to 'study' with friends but actually just talking, laughing, and eating snacks",
    "Running down broad street when the eagles won the superbowl",
    "Winning a quizzo night at smokes",
    "Exploring Philly with friends",
    "Calling my grandparents every day"
  ],
  "thingsLearnt": [
    "When given the choice between being right and being kind, choose kind",
    "If its meant to be, it will be",
    "If you don't ask, the answer is always no"
  ],
  "booksForFun": [],
  "thingsProudOf": [
    "Recovering from an eating disorder",
    "My overgrown plant collection",
    "My knowledge of the words to every taylor swift song",
    "My banana muffin recipe",
    "Being my friends #1 fan and supporter"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [],
  "comfortZone": [
    "Delaying medical school to start a nonprofit organization with zero prior business or nonprofit leadership experience"
  ],
  "endOfTheWorld": [
    "Narrowly passing my arabic choir class (having to ask for extra credit to avoid failing)"
  ],
  "leapsOfFaith": [],
  "advice": [],
  "email": "christina@bodyempowerment.net",
  "name": "Christina Miranda",
  "class": "2022",
  "type": "senior",
  "linkedIn": "https://www.linkedin.com/in/christina-miranda-526b4616a/",
  "personalWebsite": "",
  "publicEmail": "christina@bodyempowerment.net",
  "shortBio": "Christina graduated from the School of Arts and Sciences in May of 2021. Now, Christina works full time on the nonprofit organization that she cofounded, Body Empowerment Project, while also applying for medical school. Christina received the 2021 President's Engagement Prize which has enabled her nonprofit work on eating disorder prevention in Philadelphia public schools. For more information about her work with Body Empowerment Project, please visit www.bodyempowerment.net or contact her at christina@bodyempowerment.net. https://www.linkedin.com/in/christina-miranda-526b4616a/ ",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/christina%20miranda%20-%20Christina%20Miranda.jpeg"
},
{
  "_id": {
    "$oid": "6202aa0d4c10a915e23e2891"
  },
  "companiesRejectedFrom": [
    "Udall scholarship (the first time I applied)",
    "Truman scholarship",
    "Public policy research scholars",
    "Various non-profits or other internships"
  ],
  "thingIsworeIdFinish": [],
  "everydayLs": [
    "Getting enough sleep",
    "Remembering to eat every meal",
    "Drinking enough water",
    "Waving to someone on Locust without them seeing me -- so I'm stuck awkwardly standing there with my hand in the air",
    "Unsuccessfully trying to do everything I'm interested in while only having 24 hours in the day"
  ],
  "memoriesImade": [
    "Learning to unicycle in my freshman dorm",
    "Morning runs with friends to the schuylkill river",
    "Going on a road trip with new friends",
    "30 minute lunches that turn into 3 hour long conversations",
    "Going to my first pride parade",
    "Exploring my Jewish identity",
    "Leaving the Penn bubble to explore Philadelphia"
  ],
  "thingsLearnt": [
    "You can say no to opportunities",
    "Having a consistent sleep schedule does make a difference",
    "The most important relationship in your life is the one you have with yourself",
    "Every experience, both positive and negative, can teach you something"
  ],
  "booksForFun": [],
  "thingsProudOf": [
    "At the times when I had a kitchen, I cooked almost every meal",
    "I try to meditate every day",
    "I make an effort to follow through on making lunch plans with friends I bump into on locust walk",
    "I try to face everything with a positive attitude and a personal growth mindset"
  ],
  "unconventionalSkills": [
    "Juggling (regular or flaming objects)",
    "Aerial silks",
    "Stilts",
    "Diablo",
    "Devil sticks",
    "Unicycling"
  ],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [
    "I'm colorblind",
    "I love spicy food",
    "My family used to travel with the circus",
    "I lucid dream",
    "I am a big fan of camping and got into solo-camping trips during the pandemic",
    "I like reading and writing poetry",
    "My favorite place to be is underwater, whether scuba diving or free diving"
  ],
  "comfortZone": [],
  "endOfTheWorld": [],
  "leapsOfFaith": [
    "Giving up my ra position and multiple scholarships to take a leave of absence to work on the presidential campaign trail",
    "Deciding to do a speaking tour with a heavy course load (kind of a mistake)",
    "Running for student government",
    "Dropping my econ major"
  ],
  "advice": [
    "Study what you're passionate about, not just what you think will get you a job",
    "We have a limited amount of time in our day so choose a few things to focus on instead of overextending yourself",
    "Try to follow a good sleep schedule",
    "Get a coffee maker"
  ],
  "email": "benmay@sas.upenn.edu",
  "name": "Ben May",
  "class": "2021",
  "type": "curf",
  "linkedIn": "https://www.linkedin.com/in/ben-may-09a8b0100/",
  "shortBio": "Ben graduated in December 2021 with a major in International Relations and a minor in History. While on campus, he found homes with Perry World House, Kite & Key, the Undergraduate Assembly, Intercol, Harrison RA-staff, and various sustainability groups. He took a year-long leave of absence in 2020 to work on the Biden for President campaign. He is currently figuring out his post-graduation plans but hopes to eventually work in the climate policy space.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/IMG-0636%20-%20Ben%20May.jpg"
},
{
  "_id": {
    "$oid": "6202a7614c10a915e23e288b"
  },
  "companiesRejectedFrom": [
    "Rhodes scholarship",
    "Marshall scholarship",
    "President's engagement prize",
    "25+ medical schools",
    "An internship with the leonard davis institute of health economics",
    "Several research positions at the cdc"
  ],
  "thingIsworeIdFinish": [
    "Emt training",
    "Learning spanish",
    "Doing a german minor in college",
    "All the books I started",
    "Actually learning how to cook"
  ],
  "everydayLs": [
    "Consistently smudging my eyeliner and having to start over",
    "Always buying umbrellas that flip up in the rain/wind",
    "Being the clumsiest person I know"
  ],
  "memoriesImade": [
    "Going to wawa at 2 am with friends from my hall during finals week freshman fall",
    "Going on late-night walks into center city",
    "Trying all the food trucks on campus (and missing them when I went back home)",
    "Going to a concert for the first time the week of an orgo exam"
  ],
  "thingsLearnt": [
    "There is no shame in asking for help--be your own biggest personal advocate",
    "Growth can be uncomfortable, but you'll be able to look back and see how far you've truly come",
    "Take time for & prioritize your mental health"
  ],
  "booksForFun": [],
  "thingsProudOf": [
    "Overcoming a lot of imposter syndrome about being at penn & feeling inadequate and behind, especially in my pre-med classes",
    "Becoming more comfortable in my own skin and speaking up for issues I care about",
    "Becoming more resilient & being content with my best effort not always yielding the results I wanted",
    "Making time for the people most important to me"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [
    "Waking up super early to study and then taking naps at 11 am",
    "Being able to bend my fingers almost to the back of my hand",
    "Not being afraid to strike up conversations with people I don't know",
    "Drinking iced coffee regardless of the weather"
  ],
  "comfortZone": [
    "Joining a consulting club sophomore year",
    "Sticking with the chem minor",
    "Applying to over a hundred med schools",
    "Taing a course I struggled with freshman year",
    "Going to caps"
  ],
  "endOfTheWorld": [
    "Failing every chem101 exam my freshman fall",
    "Not being able to do a study abroad in college",
    "Having to take the mcat twice",
    "Starting 20-page final papers the day before they were both due"
  ],
  "leapsOfFaith": [],
  "advice": [
    "Don't be afraid to ask for help--you are not the only one struggling",
    "One class or exam score is not going to make or break your future, so make sure you remember to take breaks and have fun",
    "Be open to new possibilities"
  ],
  "email": "sakshi75sehgal@gmail.com",
  "name": "Sakshi Sehgal",
  "class": "2021",
  "type": "curf",
  "shortBio": "Sakshi Sehgal graduated from Penn in May 2021 with a Bachelor's and Master's in Philosophy with a minor in Chemistry. This year, Sakshi has been pursuing a Master's in Public Health in Healthcare Management at the Rollins School of Public Health at Emory University in her hometown of Atlanta, Georgia. After graduation, Sakshi will be attending medical school in the fall. At Penn, Sakshi was involved in many advocacy and service-oriented activities, particularly for the first-gen, low-income (FGLI) community with which she identifies, and she hopes to serve these individuals in the future as a community-oriented physician.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/SAKSHI_SEHGAL_updated_edited%20-%20Sakshi%20Sehgal.png"
},
{
  "_id": {
    "$oid": "6202a7914c10a915e23e288c"
  },
  "companiesRejectedFrom": [
    "5 out of 7 transfer applications"
  ],
  "thingIsworeIdFinish": [
    "Many books",
    "Various perishable foods",
    "A working paper clock"
  ],
  "everydayLs": [
    "Getting distracted by small noises in quiet places"
  ],
  "memoriesImade": [
    "Beautiful hikes in new mexico",
    "Enjoying vegan food with friends",
    "Bellringing outings"
  ],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [],
  "unconventionalSkills": [
    "English-style bellringing",
    "Raising each eyebrow independently"
  ],
  "thingsIwouldDoInstead": [
    "Ring at more bell towers",
    "Hike in cool places"
  ],
  "unexpectedTwists": [],
  "quirks": [],
  "comfortZone": [],
  "endOfTheWorld": [
    "Not realizing there was another page on an exam"
  ],
  "leapsOfFaith": [
    "Transferring to Penn",
    "Deciding to leave Penn for grad school"
  ],
  "advice": [
    "Taking classes outside your major is more worthwhile than you think",
    "Stressing over which classes to take is less worthwhile than you think"
  ],
  "email": "atimmel@sas.upenn.edu",
  "name": "Abigail Timmel",
  "class": "2020",
  "type": "curf",
  "shortBio": "Abigail graduated from the College in December 2020 with a B.A. and M.S. in Physics.  She is currently doing an MPhil in Physics at University of Cambridge on a Churchill Scholarship.  Next year she will be starting a PhD in Physics at MIT.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/headshot_840x702%20-%20Abigail%20Timmel.png"
},
{
  "_id": {
    "$oid": "6202a8124c10a915e23e288d"
  },
  "companiesRejectedFrom": [
    "Usaid internship",
    "Philadelphia health & human services policy internship",
    "Doctors without borders internship",
    "Puentes de salud internship",
    "Apali",
    "Johns hopkins rn job",
    "Ny presbyterian,  Penn medicine, northwell health, mount sinai (none of them have gotten back to me to this day...)",
    "Mayo clinic externship",
    "Nursing study abroad course in guatemala",
    "Rhodes/marshall/fulbright",
    "Msc in global health science and epidemiology at oxford",
    "Many many more"
  ],
  "thingIsworeIdFinish": [
    "Writing and submitting articles to journals",
    "Going back and reviewing drugs from the pharmacology class that i barely passed",
    "Learning guitar",
    "Going to dc during cherry blossom season",
    "Eating at zahav",
    "Reading a book a month (or even a semester) for fun",
    "Going to pottruck",
    "Learning french"
  ],
  "everydayLs": [
    "Staying up half asleep til 6 am on fridays working on nursing care plans",
    "Waking up 20 minutes before clinical and having to speed walk to the hospital in fear of a $200 late fee every single time",
    "Taking 20 minute 'naps' at 9 pm that turn into 2-3 hours",
    "Forgetting to water my plants until they've curled and become crispy"
  ],
  "memoriesImade": [
    "Admiring the fall foliage and spring blossoms on and off campus",
    "Thrifting with friends in west philly",
    "Going to philadelphia orchestra concerts",
    "Exploring different restaurants in south philly",
    "Baking and inviting friends over to eat"
  ],
  "thingsLearnt": [
    "Relationships (friends, family) always > accomplishment",
    "How can I expect to help others on a larger scale if I can't even take good care of myself, or be good to the few people I already love and care about around me?"
  ],
  "booksForFun": [
    "The illustrated man by Ray Bradbury",
    "The color purple by Alice Walker",
    "If Beale street could talk by James Baldwin",
    "The unbearable lightness of being by Milan Kundera",
    "A girl is a body of water by Jennifer Nansubaga Makumbi",
    "Everyone's a aliebn when ur a aliebn too by Jonny Sun"
  ],
  "thingsProudOf": [
    "Learning how to brown meat and veggies properly without burning them"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [
    "Trying to get a new grad nursing job in the er in the height of a pandemic",
    "Yue kee food truck not being there after the pandemic started"
  ],
  "quirks": [],
  "comfortZone": [
    "Taking classes outside the school of nursing where I felt like the least qualified person in the room",
    "Working in a wet lab",
    "Pretty much every club/job I joined at penn",
    "Every single shift in the er"
  ],
  "endOfTheWorld": [
    "Not getting an internship i really wanted and thought I was a good fit for"
  ],
  "leapsOfFaith": [],
  "advice": [
    "A 80 year-old patient recently diagnosed with cancer told me, 'I have two phds. but I know nothing. why has it taken me 80 years to learn this? I should have been a better person. a better son, a better grandson, a better husband, a better jew. why did I realize this so late?'"
  ],
  "email": "ruthl@nursing.upenn.edu",
  "name": "Ruth Lee",
  "class": "2020",
  "type": "curf",
  "shortBio": "Ruth graduated from the School of Nursing in May 2020 with minors in global health and religious studies. At Penn, she was involved in research, Perry World House, and Grace Covenant Church. After graduation, she has been working in an emergency room in New York City.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/photo_landscape%20-%20Ruth%20Lee.jpg"
},
{
  "_id": {
    "$oid": "6202aa4e4c10a915e23e2892"
  },
  "companiesRejectedFrom": [
    "Rhodes",
    "Marshall",
    "Soros",
    "Truman"
  ],
  "thingIsworeIdFinish": [],
  "everydayLs": [
    "I am the biggest procrastinator",
    "I still haven't figured out a regular workout schedule",
    "I'm perpetually dehydrated",
    "I stay up way too late watching tv shows on a regular basis",
    "I have the memory of a goldfish"
  ],
  "memoriesImade": [
    "Dancing with my best friends",
    "Taking long walks and exploring the city",
    "Eating and laughing until my stomach hurt",
    "Trekking through a blizzard and stopping to have a snowball fight"
  ],
  "thingsLearnt": [
    "I truly remember so little content from my classes (see above about being like a goldfish), but I distinctly remember when people were there for me and when I could be there for others- I'll never forget that",
    "We are truly so much more than what we put on our resume (even if employers or fellowship committees think otherwise)",
    "It never hurts to say 'i love you' to family and friends",
    "We have to cut ourselves more breaks",
    "Someone once said to me, 'what would you tell your best friend if they were in the same situation?' made me realize that we are not nearly as kind to ourselves as we should be"
  ],
  "booksForFun": [
    "The namesake",
    "Becoming",
    "Song of achilles",
    "The seven husbands of Evelyn Hugo",
    "Educated",
    "Eleanor Oliphant is completely fine",
    "Normal people"
  ],
  "thingsProudOf": [
    "Completing an 8 hour hike up in the highest mountain in wales",
    "Finishing at d8 bowl with extra egg at koreana",
    "Checking in with my parents everyday"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [
    "My curly hair has become my whole identity (I know, ironic that in the headshot I used for this I straightened my hair)",
    "I end every text with several exclamation points or a 'haha'",
    "I talk an absurd amount about how I'm from Arizona"
  ],
  "comfortZone": [],
  "endOfTheWorld": [],
  "leapsOfFaith": [],
  "advice": [],
  "email": "natashamenon98@gmail.com",
  "name": "Natasha Menon",
  "class": "2020",
  "type": "curf",
  "shortBio": "Natasha Menon graduated from the University of Pennsylvania in 2020 as a Philosophy, Politics, and Economics major in the College of Arts and Sciences. She is currently a first-year student at NYU School of Law. Before pursuing her JD, she spent a year as a Thouron Scholar at the London School of Economics completing a Master's in International Migration and Public Policy. ",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/_A735227%202%20-%20Natasha%20Menon.jpg"
},
{
  "_id": {
    "$oid": "6202ab0f4c10a915e23e2894"
  },
  "companiesRejectedFrom": [
    "Penn undergraduate research mentorship (purm) program",
    "Marshall scholarship",
    "Harm reduction research assistant"
  ],
  "thingIsworeIdFinish": [
    "A journal (still working on getting started!)",
    "Too many class readings to count",
    "Learning how to code after cis 110",
    "Applications that I doubted myself too much to submit"
  ],
  "everydayLs": [
    "Walking embarrassingly fast down locust because I left five minutes than I told myself i would",
    "Falling out of a backflip in front of an entire stadium of people in the palestra",
    "Snoozing my alarm more than three times",
    "Being unable to think of a single question until after the meeting is over"
  ],
  "memoriesImade": [
    "Roommate dinners after a long cheer practice",
    "Movie nights when we talked and laughed too much to actually watch",
    "Center city strolls and people-watching",
    "Rolled ice cream and five guys fries with my family",
    "Endless goofy facetimes",
    "Jam sessions when the notes mattered way less than the vibes"
  ],
  "thingsLearnt": [
    "Fail forward",
    "It's okay to just admit 'I don't know' when you don't know",
    "The only way to guarantee you won't get something is to never try"
  ],
  "booksForFun": [
    "A world without you - Beth Revis",
    "Boo - Neil Smith",
    "A monster calls - Patrick Ness, ‎Siobhan Dowd",
    "Zeroes - Scott Westerfield",
    "Tattoo atlas - Tim Floreen",
    "The martian - Andy Weir"
  ],
  "thingsProudOf": [
    "Raising my siblings",
    "Learning how to trust myself",
    "Branching out and getting out more",
    "Hitting unmute more often",
    "Successfully walking through Philly without apple maps",
    "Representing the people who helped me get here"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [
    "Play with my siblings",
    "Sing",
    "Take a walk without a destination",
    "Read that book I keep meaning to read",
    "Make brunch with friends",
    "Call my mom"
  ],
  "unexpectedTwists": [
    "Spending over a quarter of my college experience from home but being able to work in the school of my childhood and having an extra year and a half to watch my siblings grow up"
  ],
  "quirks": [
    "Problematically persistent procrastination",
    "Midwestern manners",
    "An affinity for alliteration",
    "Sticking out my tongue every time I smile",
    "A high-pitched laugh",
    "Having more optimism than ambition",
    "The uncanny ability to make everyone else around feel all of my anxiety and all of my joy before and after i finish a big project",
    "Taking any chance I can to talk about my family"
  ],
  "comfortZone": [
    "Small seminars",
    "Writing a thesis",
    "Cold emailing",
    "Accepting more invitations",
    "Asking more people to get lunch together and actually going"
  ],
  "endOfTheWorld": [],
  "leapsOfFaith": [
    "Going to college 1642 miles away (and going to grad school 4512 miles away)",
    "Asking a writing sem professor (and a high school teacher) to write a recommendation",
    "Being the only male cheerleader in my region back home (and falling in love with the sport)"
  ],
  "advice": [
    "Take your time",
    "Speak more",
    "Trust yourself"
  ],
  "email": "ntl@sas.upenn.edu",
  "name": "Nicholas Thomas-Lewis",
  "class": "2022",
  "type": "curf",
  "shortBio": "Nicholas Thomas-Lewis (C'22) is majoring in cognitive science with a concentration in cognitive neuroscience as well as health and societies with a concentration in public health and minoring in neuroscience at the University of Pennsylvania. Thomas-Lewis’s honors thesis is on the dual ‘neuromedicalization’ of adolescence and addiction and its impact on stigma and agency among adolescents with addiction. He is a mentor who supports literacy development and emotional wellbeing in West Philadelphia elementary schools through the Netter Center for Community Partnerships. Thomas-Lewis is captain of Penn’s varsity cheer team and a former speech captain for Penn Speech and Debate club. He has coached high school cheer and speech programs to state medal performances in his home of Nebraska. Thomas-Lewis also serves as a campus guide for the Kite & Key Society, is a vocal performer with the Penny Loafers, and is co-chair of the Admissions Dean’s Advisory Board. After graduation, Thomas-Lewis will study at Oxford through the Rhodes Scholarship program. Thomas-Lewis hopes to pursue master’s degrees in evidence-based social intervention and policy evaluation and medical anthropology. Profoundly impacted by addiction in his family, Thomas-Lewis intends to develop community programs to support youth affected by addiction to provide care and preventive services while gathering evidence for more compassionate substance use policies.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Headshot_Nicholas_Thomas-Lewis%20-%20Nicholas%20Thomas-Lewis.jpg"
},
{
  "_id": {
    "$oid": "6202a9134c10a915e23e288f"
  },
  "companiesRejectedFrom": [],
  "thingIsworeIdFinish": [
    "My hispanic studies minor",
    "Most of the books I opened during the school year",
    "Learning italian",
    "My goal to journal more in 2021",
    "My history minor",
    "The final 6 med school apps I planned to do"
  ],
  "everydayLs": [
    "My first 7 or 8 western blots in my bio lab",
    "Permanently ruining my shoes on a glue trap for bugs in harnwell",
    "Somehow sleeping through a 1pm class multiple times freshman year",
    "Cooking at most once a month for most of college",
    "Organic chemistry 2",
    "Being arguably the worst dancer in the entire glee club"
  ],
  "memoriesImade": [
    "Celebrating in center city the night the eagles won the super bowl",
    "Discovering a secret haunted house behind the cabins at camp kesem",
    "Letting off steam at distrito after chemistry lab",
    "Spontaneous late-night trips to south philly for tacos",
    "Wandering the night markets of taipei with the glee club",
    "Singing and playing piano at open mic nights",
    "Making (terrible) banana bread in a blender with my roommates"
  ],
  "thingsLearnt": [
    "A stressful or bad situation now will make for a great story later",
    "Coffee simply cannot replace sleep",
    "Doing what you sincerely love makes you a far more interesting person",
    "Despite how it may seem, absolutely nobody has it all figured out",
    "Being surrounded by the right people can make everyday experiences unforgettable",
    "Everybody has something to teach you"
  ],
  "booksForFun": [
    "The brief, wondrous life of oscar wao by Junot Díaz",
    "The sense of an ending by Julian Barnes",
    "Giovanni's room by James Baldwin",
    "100 years of solitude by Gabriel García Márquez",
    "Poema del cante jondo by Federico García Lorca",
    "As many of Jorge Luis Borges' ficciones as I could get through"
  ],
  "thingsProudOf": [],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [
    "Learning to tap dance",
    "Deciding to fully commit to being premed junior year",
    "Being literally the only non-freshman in my math 104 class during senior spring",
    "Moving to spain in a global pandemic",
    "Doing history research as a premed",
    "Performing around the world with the glee club"
  ],
  "quirks": [],
  "comfortZone": [],
  "endOfTheWorld": [
    "Getting rejected by all the a cappella groups i auditioned for freshman year",
    "Withdrawing from a bbb class and having that on my transcript forever",
    "Dropping a 60 on my first chem exam",
    "Many panicked calls to my advisor catastrophizing about my life goals and career plans",
    "Getting a much lower mcat score than i had hoped"
  ],
  "leapsOfFaith": [],
  "advice": [
    "Nobody knows what they want to do for the rest of their life when they're 18, and that's really ok",
    "There is never any shame in asking for help",
    "Find a creative outlet",
    "Tell your friends you love them",
    "Travel whenever you can",
    "Take classes that have absolutely nothing to do with your major"
  ],
  "email": "hoffh@sas.upenn.edu",
  "name": "Henry Hoffman",
  "class": "2020",
  "type": "curf",
  "shortBio": "Henry Hoffman is recent Penn alumnus from the College of Arts and Sciences (Class of 2020) who majored in Biology. After graduating, he moved to Madrid, Spain, to teach English on a Fulbright Scholarship. Within a month of arriving, he fell in love with Spain, and is currently spending a second year teaching abroad, this time at a middle school in Granada. He is also currently applying to medical school. Henry is always eager to talk to students about his experiences, and encourages you to reach out to him about fellowships, being premed at Penn, or anything else you might want to talk through! You can reach him via email at hoffh@sas.upenn.edu, or on LinkedIn at https://www.linkedin.com/in/henry-hoffman-87419a128.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Hoffman%20photo%20-%20Henry%20Hoffman.jpg"
},
{
  "_id": {
    "$oid": "61fbc9084e4431632f7a36cd"
  },
  "companiesRejectedFrom": [
    "6 sociology phd programs: yale",
    "Princeton",
    "Nyu",
    "Harvard",
    "Berkeley",
    "And stanford",
    "6 fellowships: the nsf graduate research fellowships program",
    "The social science resource council international dissertation research fellowship (twice)",
    "The ford foundation fellowship",
    "Soros fellowship",
    ""
  ],
  "thingIsworeIdFinish": [
    "Still have not managed to figure out how to reply to emails in less a timely manner (seriously, just replied to someone who emailed me in November.... 2020)",
    "Have yet to submit a monthly report to my committee about my updates... four months into fieldwork",
    "My christmas cards",
    "An art project I started at the beginning of the pandemic"
  ],
  "everydayLs": [],
  "memoriesImade": [],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [
    "Rescuing the most perfect pup from acct philly",
    "Choreographing two indian wedding dances despite being a terrible dancer",
    "Always making time for my friends",
    "Hiking endlessly",
    "Becoming a really good cook"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [
    "I hate to admit that I have napped my way through many zoom meetings "
  ],
  "unexpectedTwists": [
    "I was supposed to leave for fulbright in september of 2020, so for the last year I had to find new ways of being a graduate student. I taught and TA'd many classes, helped plan and run a graduate student conference which ended up being one of my favorite graduate school memories, and got to actually enjoy the graduate student community (though lots of long walks)."
  ],
  "quirks": [],
  "comfortZone": [],
  "endOfTheWorld": [
    "I think everytime I get a paper rejection it feels like the end of the world, but usually the reviews are quite helpful and hopefully one day soon one of my papers will go through (fingers crossed)"
  ],
  "leapsOfFaith": [
    "When I decided Penn was the right program for me, I said no to my two other offers despite being on the waitlist here and properly accepted there. it paid off because I was able to come to Penn that year, but either way it felt really good to have clarity in what I wanted."
  ],
  "advice": [
    "To enjoy the present moment and take everything slightly less seriously"
  ],
  "email": "rakasen@sas.upenn.edu",
  "name": "Raka Sen",
  "class": "PhD",
  "type": "curf",
  "shortBio": "Raka Sen is a 5th year PhD candidate in Sociology at Penn. Her work is on how people are adapting to climate change in the everyday in the Sundarban forest of Bangladesh and India.  She is currently on a Fulbright-Nehru research grant in India conducting her fieldwork for this project for the next 9 months.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/sen_raka%2B%281%29%20-%20Raka%20Sen.jpg"
},
{
  "_id": {
    "$oid": "6202a9b34c10a915e23e2890"
  },
  "companiesRejectedFrom": [
    "Thouron award(2016 and 2019 cycles)",
    "Charles b. rangel fellowship (2019)",
    "Thomas r. pickering fellowship (2019)",
    "Fulbright program  eta award (kyrgyzstan) 2016"
  ],
  "thingIsworeIdFinish": [
    "My blog",
    "Fixing up my old ford f-250 pickup"
  ],
  "everydayLs": [],
  "memoriesImade": [
    "I thru-hiked 330 miles of the john muir and pacific crest trails",
    "Traveled extensively with my siblings, from the mountains of the american west to the cultural capitals of central Europe",
    "Rediscovered my family's ancestral home and distant relatives in Norway",
    "Trained for and ran my first half marathon"
  ],
  "thingsLearnt": [
    "Faith, education, and family are important."
  ],
  "booksForFun": [
    "The foundation trilogy",
    "Wheel of time",
    "Lord of the rings",
    "A gentleman in moscow",
    "Six frigates"
  ],
  "thingsProudOf": [
    "Personal values",
    "Friendships",
    "Family:"
  ],
  "unconventionalSkills": [
    "A-level chainsaw certification (since lapsed)"
  ],
  "thingsIwouldDoInstead": [
    "Enjoy the outdoors, sing, or sit down with a good book"
  ],
  "unexpectedTwists": [
    "I was set to be a mining engineer until I heard I was accepted to study history and german at UPenn. this path led to developing a passion for politics, foreign affairs and cultures, and public service."
  ],
  "quirks": [
    "I don't like the spotlight",
    "I'm more comfortable in jeans and a hoodie than a suit and tie"
  ],
  "comfortZone": [
    "I moved to philadelphia, a city 4,000 times the population of my hometown",
    "Attended Penn",
    "Lived for four years in foreign cultures as an exchange student and peace corps volunteer",
    "Led groups of teenagers as a leader of a youth crew in month-long, immersive wilderness experiences while in the americorps",
    "Hiked solo for 23 days through the Sierra Nevada."
  ],
  "endOfTheWorld": [
    "I got a d+, my worst grade since first grade, on my last final (intro to micro-econ) at Penn",
    "Misspelled 'lutestring' at my school's 6th-grade spelling bee"
  ],
  "leapsOfFaith": [
    "Going to Penn, Europe, moving to California"
  ],
  "advice": [
    "Get more sleep. don't wait until senior year to explore outside the Penn bubble! find time for yourself. you deserve to be here."
  ],
  "email": "john_lillegard@yahoo.com",
  "name": "John S Lillegard",
  "class": "2016",
  "type": "curf",
  "shortBio": "John Lillegard, a 2022 Charles B. Rangel Fellow, was raised in the rural town of Stanford, Montana, and attended the University of Pennsylvania's School of Arts and Sciences, where he earned a bachelor’s degree in history and German studies in 2016. Since graduation, John has pursued a career in public service. John taught English as a foreign language for two years with the Peace Corps in Ukraine and later served in the Montana Conservation Corps, an AmeriCorps program, as a youth crew leader. He currently works as a legal administrative specialist for the asylum division of United States Citizenship and Immigration Services.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/LillegardJohnPhoto%20-%20John%20Lillegard.jpg"
},
{
  "_id": {
    "$oid": "6202acdd4c10a915e23e2897"
  },
  "companiesRejectedFrom": [
    "Bain & company (first time)",
    "Mckinsey (first time)",
    "BCG (twice)",
    "DE Shaw",
    "EY parthenon",
    "Simon kucher & partners",
    "Captech consulting",
    "Cornerstone research",
    "Mastercard",
    "Brighthouse",
    "Dow jones",
    "Google bold",
    "Mercer",
    "Anthos VC",
    "Weiss asset management",
    "Adobe",
    "Waterfall asset management",
    "Two sigma",
    "Comcast analytics",
    "Comcast marketing",
    "Disney: corporate strategy & business development",
    "Morgan stanley equity research",
    "Linkedin",
    "Expedia",
    "Google emea",
    "Google dubai, nairobi, lagos, istanbul, kiev, joburg",
    "Rocket internet",
    "Bloomberg",
    "Bessemer fellowship",
    "JP Morgan",
    "Visa consulting & analytics",
    "Blackrock",
    "Salesforce",
    "Moelis & company",
    "Tesla",
    "Global founders capital",
    "Zx ventures",
    "Pwc - strategy",
    "Roland berger",
    "Slalom",
    "Goldman sachs",
    "Facebook",
    "Oliver wyman",
    "Microsoft",
    "Bullish",
    "Apple",
    "Amazon",
    "Loeb.nyc",
    "Putnam associates",
    "Coca cola and more.",
    "total: 114 rejections junior year."
  ],
  "thingIsworeIdFinish": [
    "A journal",
    "The wharton 5k race… every year."
  ],
  "everydayLs": [
    "Inability to make good coffee"
  ],
  "memoriesImade": [
    "Wharton council alumni brunches in nyc",
    "Whamb is social (if you know, you know)",
    "Sledding down the philadelphia art museum’s stairs on snow day",
    "Smokes sink or swim."
  ],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [
    "All the urban studies classes I took",
    "Extensive spreadsheet of all of Philadelphia’s happy hours."
  ],
  "unconventionalSkills": [
    "Puzzle making",
    "Google maps navigation",
    "Biking around philadelphia regardless of season",
    "Ability to name 20+ painters at the barnes foundation."
  ],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [],
  "comfortZone": [
    "Going to math104 office hours",
    "Learning to raise my hand and speak up in class",
    "A solo journey to the republic of moldova and ukraine for a research paper",
    "Proceeding to go into transnistria, the frozen conflict zone located between moldova and ukraine and interview female entrepreneurs"
  ],
  "endOfTheWorld": [
    "12 club rejections freshman fall",
    "Wharton council co-chair election (first time around)",
    "Falling down the stairs of the huntsman forum in front of everyone"
  ],
  "leapsOfFaith": [
    "Giving up the 3-year stem opt u.s. work visa extension I worked so hard for in order to pursue a masters in global affairs in Beijing",
    "Taking my first ever mandarin course as a second-semester senior."
  ],
  "advice": [
    "First, you will soon learn that you can’t succeed on your own",
    "Second, prepare yourself for failure, not just success",
    "Third, seek to do things outside your comfort zone",
    "Fourth, focus on the people around you. your friends, in this place far away from where you grew up and spent most of your life, will become family."
  ],
  "email": "cpogo@wharton.upenn.edu",
  "name": "Cristina Pogorevici",
  "class": "2021",
  "type": "curf",
  "shortBio": "Cristina is from Romania and graduated from Wharton concentrations in Business Analytics and Management (Entrepreneurship & Innovation track). She is currently a Schwarzman Scholar in Beijing, China pursuing a Masters in Global Affairs before starting as a consultant for Bain & Company in New York.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202022-02-08%20at%202.13.22%20PM.png"
},
{
  "_id": {
    "$oid": "6202abdd4c10a915e23e2895"
  },
  "companiesRejectedFrom": [
    "Goldman sachs",
    "Zip code wilmington coding bootcamp",
    "Bank of america internship",
    "Ocr interviews",
    "Google"
  ],
  "thingIsworeIdFinish": [
    "Schwarzman scholarship application",
    "21 books in 2021",
    "Decluttering my computer",
    "Deleting unnecessary emails in my inbox",
    "Becoming fluent in french",
    "Starting a youtube channel",
    "This anti-resume by the deadline"
  ],
  "everydayLs": [
    "Going to the gym consistently",
    "Not eating breakfast consistently because of the am rush",
    "Managing my emotions",
    "Making time to read books for fun",
    "Calling family members"
  ],
  "memoriesImade": [
    "Going out for brunch with friends",
    "Going to the movies or hanging out with my siblings",
    "Taking time off from work for necessary rest or self care days"
  ],
  "thingsLearnt": [
    "I am enough",
    "Get more rest",
    "Focus on who you are becoming",
    "Focus on peace of mind and happiness",
    "Learn to reframe situations rather than react to situations",
    "This too shall pass",
    "Get out of whatever box you have placed yourself in. the world is large. find ways to expand your personal world",
    "You can do hard things. just take it one step at the time"
  ],
  "booksForFun": [
    "The alchemist by Paulo Coelho",
    "God wears lipstick by Karen Berg",
    "The davinci code by Dan Brown",
    "Can't hurt me by David Goggins"
  ],
  "thingsProudOf": [
    "Completing my nightly routine which helps me to unwind after a long day at work",
    "Calling my mom and other family members",
    "Keeping a monthly journal",
    "Learning how to heal and do the necessary inner work in order to forgive myself or others for wrong doing"
  ],
  "unconventionalSkills": [
    "Risk taking",
    "Curiosity",
    "Listening to learn",
    "Smiling",
    "Finding a silver lining in situations"
  ],
  "thingsIwouldDoInstead": [
    "Travel the world",
    "Tap more into my creative side",
    "Start a YouTube Channel",
    "Lay in bed and read my favorite books",
    "Go to the beach"
  ],
  "unexpectedTwists": [
    "Moving to Liberia for a year and working with young girls from an underprivileged background gave me a more nuanced view of how I want to leave my mark on the world",
    "Taking a gap year or two before jumping back into school"
  ],
  "quirks": [
    "I'm very optimistic",
    "You can always catch me with a smile on my face"
  ],
  "comfortZone": [
    "Lived in another country for a year",
    "Joined the air force reserve",
    "Starting and running a nonprofit organization"
  ],
  "endOfTheWorld": [
    "Dropping chem101 after getting a series of bad grades",
    "Crying or feeling sad because I did't do too well in a specific class",
    "Feeling like my timeline is off because I haven't applied to grad school yet",
    "Romantic relationships that haven't worked out"
  ],
  "leapsOfFaith": [
    "Joining the air force reserve"
  ],
  "advice": [
    "Learn to listen to your body when it says it needs something (rest, food, etc.)",
    "Hang out with your friends and family more",
    "Get to know other people who are not in your friend group",
    "Learn a skill just for fun",
    "Take advantage of more opportunities to travel",
    "Have goals and a vision but don't be too hard on yourself if things don't go exactly as planned"
  ],
  "email": "summerjkollie@gmail.com",
  "name": "Summer Kollie",
  "class": "2019",
  "type": "curf",
  "shortBio": "Summer Kollie (Health and Societies, SAS '19) was born in Monrovia, Liberia, and immigrated to South West Philadelphia when she was six years old. Following her senior year at Penn, she won the President's Engagement Prize along with two other Penn students and moved to Liberia to start Rebound Liberia. Rebound Liberia is a 501c3 organization that uses basketball to uplift and empower young Liberian women. After spending a year in Liberia starting Rebound Liberia, Summer moved back to Philly at the end of 2020. Since then she has worked in the human service field as a Program Specialist and Intake Coordinator. In her free time she enjoys taking breaks, sleeping, reading and traveling. ",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202022-02-08%20at%202.12.23%20PM.png"
},
{
  "_id": {
    "$oid": "6202ac0e4c10a915e23e2896"
  },
  "companiesRejectedFrom": [
    "30+ research labs I reached out to",
    "Schwarzman scholarship",
    "Truman scholarship",
    "Fulbright scholarship",
    "Rhodes and marshall scholarships (didn't meet the gpa requirement to apply)",
    "Harvard master's of bioethics program"
  ],
  "thingIsworeIdFinish": [
    "Psychiatry case report on a patient",
    "Digital health paper with my mentor",
    "Numerous poems and short stories"
  ],
  "everydayLs": [
    "Planned many events as an ra that had zero attendance",
    "Procrastinated on studying and missed spring fling",
    "Changed my senior thesis last minute and getting very little usable data",
    "Became a semi-professional lab rat by participating in experiments to make money",
    "Ate in the dining halls daily all the way through senior year"
  ],
  "memoriesImade": [
    "Survived off of late-night bundle boxes from mcdonalds",
    "Won a championship with the varsity sprint football team",
    "Jumped in the delaware river for a dare",
    "Celebrated in new orleans during mardis gras",
    "Rescued friends from casinos in atlantic city"
  ],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [
    "Traveled solo throughout europe during my master's",
    "Ran a marathon after my senior football season",
    "Moshed at dozens of pop punk concerts throughout college",
    "Privately mentored dozens of students",
    "Gave tours to several vips and presidential appointees"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [],
  "comfortZone": [],
  "endOfTheWorld": [
    "Got a B- in phys 150",
    "Bombed numerous acct 102 exams",
    "Lost an election in kite and key my freshman year",
    "Started a club that failed miserably",
    "Spent my entire college football career as a back-up"
  ],
  "leapsOfFaith": [
    "Applying to the lsm program as a transfer without any business experience",
    "Cold-calling dozens of people for advice or internship opportunities",
    "Turning down job offers and waiting empty-handed while waiting for one to materialize"
  ],
  "advice": [
    "Things will work out",
    "99% of the problems you are facing right now will be irrelevant 5 years",
    "Don't be afraid to ask for help when you're struggling",
    "There are many paths to success, not just the one you are focused on",
    "Not everything is a priority, so it's okay to let things slip"
  ],
  "email": "ryan.michael.leone@gmail.com",
  "name": "Ryan Leone",
  "class": "2019",
  "type": "curf",
  "shortBio": "Ryan M. Leone graduated from Penn's Vagelos Life Sciences and Management Program in 2019, where he earned a BA in Neuroscience from the College and a BS in Economics with a Concentration in Healthcare Management from Wharton. After graduation, he pursued the MSc in War & Psychiatry at King's College London through the Thouron Fellowship. He started work through the Presidential Management Fellowship as the Chief of Staff for the Healthcare Optimization Division of the Defense Health Agency and is currently on a detail to the Department of State's Bureau of Medical Services. He has commissioned as a Second Lieutenant in the U.S. Army and will be entering medical school on the Army's scholarship program in the summer of 2022. He can be reached by email at ryan.michael.leone@gmail.com, by phone at 631-987-6801, or via LinkedIn at the following link: https://www.linkedin.com/in/ryanmleone/",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/2019%20LSM%20Headshot%20-%20Ryan%20Leone.jpg"
},
{
  "_id": {
    "$oid": "61fbc6234e4431632f7a36c7"
  },
  "companiesRejectedFrom": [
    "10+ work study jobs",
    "PURM",
    "Nsf-reu internship at the american museum of natural history",
    "Internship at jackson labs",
    "Marshall scholarship",
    "Thouron award",
    "Mitchell scholarship",
    "UC santa cruz ecology and evolutionary biology graduate program",
    "National science foundation graduate research fellowship program",
    "A bunch of small scholarships I applied to"
  ],
  "thingIsworeIdFinish": [
    "My chemistry minor",
    "A major in anthropology",
    "Learning latin"
  ],
  "everydayLs": [
    "Getting bedbugs, cockroaches (at least two different species!), mice, termites, and carpet beetles from my various living situations over the last 5 years",
    "Accidentally signing emails as 'retina' instead of regina",
    "Still not having a driver's license"
  ],
  "memoriesImade": [
    "Trips to longwood gardens with my mom",
    "Going to the christmas village with my partner who went to temple",
    "Attending free Philadelphia symphony orchestra concerts"
  ],
  "thingsLearnt": [
    "The time I spent with my mom during undergrad - I thought O might regret the extra weekends I spent at home instead of studying for exams, but she got diagnosed with terminal lung cancer my first month of graduate school so I'm very grateful I made time for family"
  ],
  "booksForFun": [
    "One hundred years of solitude",
    "Crying in h mart",
    "The secret history"
  ],
  "thingsProudOf": [
    "Supporting my grandparents through their dementia diagnoses",
    "Cooking Christmas dinner for my family every year for the last 5 years",
    "My focaccia"
  ],
  "unconventionalSkills": [
    "Spotting vintage pyrex at thrift shops (one of my favorite patterns is 'forest fancies')"
  ],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [],
  "comfortZone": [
    "Moved across the country for grad school",
    "Every single time I participate in class",
    "All of my interviews"
  ],
  "endOfTheWorld": [],
  "leapsOfFaith": [],
  "advice": [],
  "email": "rafairbanks@ucdavis.edu",
  "name": "Regina Fairbanks",
  "class": "2021",
  "type": "curf",
  "shortBio": "Regina Fairbanks (C'21) majored in Biology with minors in Anthropology and Archaeological Science. Regina is now a Ph.D. student in Population Biology at the University of California, Davis. They plan to integrate evolutionary genomics and archaeobotany to study the evolution of maize. As an undergraduate student at Penn, Regina participated in research as a work study student in the Levine Lab in the Biology Department and was a Penn Museum Fellow advised by Dr. Chantel White. They were previously an NSF-REU intern at the Smithsonian National Museum of Natural History, where they studied the phylogenomics of ginseng. They are passionate about museums, plants, and the past. ",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/headshots.jpg"
},
{
  "_id": {
    "$oid": "61fbc8284e4431632f7a36cb"
  },
  "companiesRejectedFrom": [
    "U.s. state department overseas internship program (twice)",
    "Fulbright‐uk summer institutes",
    "Rhodes",
    "Marshall",
    "Mitchell",
    "Ertegun",
    "Georgetown university’s initiative for u.s.-china dialogue on global issues",
    "Curf summer humanities internship at the kislak center",
    "Hudson institute summer fellowship",
    "Philadelphia office of homeless services"
  ],
  "thingIsworeIdFinish": [
    "Stanford knight-hennesy application",
    "Write an article for a student or other publication unrelated to my studies",
    "I never broke the erg records I'd set for myself coming into Penn rowing",
    "I never made penn's top boat"
  ],
  "everydayLs": [],
  "memoriesImade": [
    "I ran into a herd of cows and got stuck",
    "Cliff diving in sorrento, italy",
    "Paid respects at the american military cemetery at normandy",
    "I became more involved with my church",
    "Dinners at sitar",
    "Drinks at smokes the night penn shut down in 2020",
    "Runs in the wissahickon"
  ],
  "thingsLearnt": [
    "Cooking, full stop, arguably the most valuable non-academic skill a young person can learn. it saves you a ton of money, makes you an asset to any friend group, and gives you the ability to take real pride in something intrinsically valuable completely unattached from your academic/career interests."
  ],
  "booksForFun": [
    "Consider the lobster (plus all of dfw's other essay collections)",
    "The spy that came in from the cold",
    "Entangled life",
    "Politics and the english language (plus a lot of orwell's non-fiction)",
    "The thursday murder club (a great peak into modern british culture)"
  ],
  "thingsProudOf": [],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [
    "My request to delay my service in the U.S. marines so that I could accept my graduate scholarship was denied, forcing me to pick between two aspirations I had worked towards accomplishing for years."
  ],
  "quirks": [],
  "comfortZone": [
    "Join the marine corps"
  ],
  "endOfTheWorld": [],
  "leapsOfFaith": [],
  "advice": [],
  "email": "danieldevaronabrennan@gmail.com",
  "name": "Daniel Brennan",
  "class": "2020",
  "type": "curf",
  "shortBio": "I graduated from the College in 2020, having double-majored in History and Political Science. In the spring of my senior year, I was fortunate to receive a Thouron Award, which provided me with the incredible opportunity of living and studying in the UK, where I am currently finishing my master's in History at Oxford University.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202022-02-08%20at%201.58.31%20PM.png"
},
{
  "_id": {
    "$oid": "61fbc89f4e4431632f7a36cc"
  },
  "companiesRejectedFrom": [
    "Yale immunobiology graduate program",
    "Harvard immunology phd program",
    "2019 nsf grfp",
    "2020 ford fellowship"
  ],
  "thingIsworeIdFinish": [
    "Journaling",
    "The harry potter books"
  ],
  "everydayLs": [
    "Reading scientific papers",
    "Eating healthy"
  ],
  "memoriesImade": [],
  "thingsLearnt": [
    "Adapt to situations",
    "Don't take things personal",
    "Treat everyone with respect",
    "Have fun",
    "Enjoy the process",
    "Prioritize your mental health",
    "Know your worth and don't let anyone take advantage of you (not even higher ups!)",
    "Make an agenda",
    "Declutter your space to declutter your mind",
    "Maintain relationships",
    "Take a break"
  ],
  "booksForFun": [
    "All the percy jackson books"
  ],
  "thingsProudOf": [
    "Proud of being puerto rican!"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [
    "Sleep",
    "Play video games",
    "Play sports"
  ],
  "unexpectedTwists": [
    "Started as a chemistry major, tried switching to an accounting major and ended up as a biology major with the intention of going to med school but I ultimately decided to become a scientist (and I love it!)."
  ],
  "quirks": [
    "Sarcasm",
    "Spontaneity",
    "Bursts of high energy"
  ],
  "comfortZone": [
    "Graduate school interviews",
    "Networking with people I don't know"
  ],
  "endOfTheWorld": [
    "Not being awarded the 2019 nsf graduate research fellowship (I pushed through the frustration and applied again for the 2020 award and got it!)"
  ],
  "leapsOfFaith": [],
  "advice": [],
  "email": "vvictor@pennmedicine.upenn.edu",
  "name": "Victor R Vazquez Marrero",
  "class": "PhD",
  "type": "curf",
  "shortBio": "Víctor R. Vázquez Marrero is pursuing his Ph.D. in Immunology at the Perelman School of Medicine. He graduated with a B.S. in Cellular and Molecular Biology from the University of Puerto Rico – Río Piedras (UPR-RP) and was dedicated to research and outreach. He spent 3 years conducting research at UPR-RP and studied infectious diseases for 3 summers. As a first-generation Latino and a member of the LGBT+ community, he has participated in numerous outreach activities such as Creando ConCiencia, Skype a Scientist, Upward Bound Program, and a mentorship program for LGBT+ students to promote diversity, equity, and inclusion within science. He was awarded the 2020 National Science Foundation Graduate Research Fellowship. After completion of his studies, Vázquez Marrero aims to return to Puerto Rico and become a tenure-track Professor who will conduct research on the immune response to infections, provide opportunities for students to explore science, and educate the public.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/253%20-%20Victor%20Vazquez.jpg"
},
{
  "_id": {
    "$oid": "61fbc6974e4431632f7a36c8"
  },
  "companiesRejectedFrom": [
    "The leadership alliance",
    "Ucla amgen scholars program",
    "Ucla spur-labs",
    "Mit amgen scholars program",
    "Mt. sinai surp",
    "Stanford amgen scholars program",
    "Uchicago reu",
    "Cincinnati children's hospital surf",
    "Rockefeller surf",
    "Sanford spur/reu",
    "Upstate surf",
    "Scripps surf",
    "Wayne state surp",
    "6/12 of phd programs I applied to",
    "14/23 md and md/phd programs i applied to",
    "Lipman family prize fellowship (2x)"
  ],
  "thingIsworeIdFinish": [
    "Squid game",
    "My weightlifting training accessory exercises",
    "Most of my music recording projects",
    "Almost every book I've taken out of the library",
    "The beginner cello lessons I signed up for"
  ],
  "everydayLs": [
    "Oversleeping my alarm by 2-3 hours for the 3rd day in a row",
    "None of my experiments working",
    "Missing the penn shuttle by literally 30 seconds",
    "Being too tired to cook and having to order ubereats...again"
  ],
  "memoriesImade": [
    "Jam sessions with my housemates",
    "Long coffee breaks with friends in-between experiments",
    "Spontaneous happy hours",
    "Late night game nights that made me laugh until my stomach hurt"
  ],
  "thingsLearnt": [
    "Very few things are the end of the world",
    "You work better in the long-run well-rested"
  ],
  "booksForFun": [],
  "thingsProudOf": [
    "Learning how to thrive after my ocd diagnosis"
  ],
  "unconventionalSkills": [
    "Remembering obscure facts about my friends and family",
    "Being able to walk anywhere from memory once I've walked there once"
  ],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [],
  "comfortZone": [],
  "endOfTheWorld": [
    "Being accepted to 0/12 of the summer research programs I applied to"
  ],
  "leapsOfFaith": [
    "Turning down my md/phd and medical school offers with no assurance of a job while I took another year to apply to grad school",
    "Deciding to tell that boy I liked him"
  ],
  "advice": [],
  "email": "hloo@pennmedicine.upenn.edu",
  "name": "Hannah Loo",
  "class": "PhD",
  "type": "curf",
  "shortBio": "Hannah is a 3rd-year Neuroscience PhD candidate at the University of Pennsylvania in the lab of Dr. Jennifer Orthmann-Murphy. Born and raised in NYC, she completed her Bachelors in Biology and Vocal Performance at SUNY Geneseo. Upon graduation, Hannah spent 2 years as a post-baccalaureate fellow at the National Institutes of Health. In 2019, she began her PhD at Penn, where her work focuses on the role of microglia in remyelination. A long-time glia fan, she is the recipient of a Goldwater Scholarship and a NSF Graduate Research Fellowship. In addition to her work as a graduate student, Hannah competes as an Olympic weightlifter, and is the Founder and Executive Director of Project SHORT, a non-profit dedicated to providing mentorship for diverse and underrepresented applicants to graduate and medical programs.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202022-02-08%20at%201.57.19%20PM.png"
},
{
  "_id": {
    "$oid": "625780c62fe6a46a9c6f12d9"
  },
  "companiesRejectedFrom": [
    "Alvarez & Marshal",
    "Guidehouse",
    "BCG",
    "EY-Parthenon",
    "McKinsey",
    "Bain",
    "PwC/Strategy",
    "Kearney",
    "Deloitte",
    "Avascent",
    "Center for American Progress",
    "Bipartisan Policy Center",
    "Council on Foreign Relations",
    "ACLU (x4)",
    "UN Foundation",
    "CSIS",
    "German Marshall Fund",
    "Partnership for Public Service",
    "Alliance for Justice",
    "AEI",
    "House Judiciary Committee",
    "NPR",
    "National Women's Law Center",
    "Women's Foreign Policy Group",
    "Urban Institute",
    "Progressive Policy Initiative",
    "National Endowment for Democracy",
    "Cravath, Swaine, & Moore",
    "Freedom House",
    "Pen America",
    "Perry World House Student Fellows (x2)",
    "Truman Scholarship",
    "Thouron Award: Marshall Scholarship",
    "+ dozens more internships/programs/fellowships"
  ],
  "thingIsworeIdFinish": [
    "Ultimate Frisbee",
    "Legal Studies & History minor",
    "My Rhodes Scholarship application",
    "A podcast about public service",
    "Too many philosophy/law books",
    "Creating a personal website"
  ],
  "everydayLs": [
    "Breaking my foot during NSO",
    "Winning free Made in America tickets and not being able to go because of the broken foot",
    "Tripping over things constantly (there's a theme here...)",
    "Not waking up early to go to the gym",
    "Not cooking enough",
    "Getting a B in GEOL 100"
  ],
  "memoriesImade": [
    "Dinners and long conversations with friends",
    "Pandemic walks through West Philly",
    "Laughing in Harnwell lounges with friends for hours",
    "Signal BYOs/retreat/secret santas/dinners/coffee chats",
    "Exploring Washington DC during Penn in Washington with new friends",
    "Sleeping outside the Supreme Court to hear oral arguments for a famous case (technically with my LGST class but still a highlight of my Penn experience!)",
    "Every restaurant week/new restaurant/happy hour with friends",
    "Every free talk/discussion at Penn",
    "Friendsgivings/Super Bowl parties/March Madness parties"
  ],
  "thingsLearnt": [
    "Never shy away from showing your intellectual curiosity",
    "Coffee chats are better when you go into the conversation just trying to get to know someone rather than a transactional experience",
    "Investing in relationships with quality people is always worth it",
    "Tough times never last and knowing that makes the tough times more bearable",
    "Don't let anyone's judgment diminish your own happiness",
    "Being comfortable alone is a great gift",
    "Loving what you study is a great and rare gift— don't be scared to pursue your dream career"
  ],
  "booksForFun": [
    "The Seven Husbands of Evelyn Hugo",
    "Taste (Stanley Tucci's Memoir)",
    "Malibu Rising",
    "Crying in H Mart",
    "One True Loves",
    "Surveillance Capitalism",
    "The Education of an Idealist (Samantha Power's memoir)",
    "Crossing to Safety",
    "The Public Sector Pivot"
  ],
  "thingsProudOf": [
    "Developing relationships with my professors",
    "Talking to my parents multiple times a week",
    "Having the guts to apply for all the internships/fellowships I found intimidating",
    "Finding a great circle of friends at Penn",
    "Fully investing myself in my classes",
    "Being emotionally honest/vulnerable",
    "Mentoring underclassmen"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [
    "Taking exclusively handwritten notes",
    "Being 5 ft. 11 in",
    "Talking about Aaron Sorkin to anyone that listens",
    "Loving food and exploring new restaurants",
    "Fast-fowarding through TV shows and movies (it's a bad habit)",
    "Speed reading"
  ],
  "comfortZone": [
    "Applying and going to Penn in Washington sophomore spring",
    "Writing a book",
    "Doing podcasts and writing op-eds after the book",
    "Applying for the Truman Scholarship and the Marshall Scholarship",
    "Cold-emailing a professor about research",
    "Coming to Penn"
  ],
  "endOfTheWorld": [
    "Not getting an internship sophomore summer (I ended up beginning to write my book that summer which completely changed my life)",
    "Getting a B- in both ECON 001 and ECON 002 despite studying the hardest I ever have",
    "Being rejected from nearly every club freshman fall (This led me to apply for The Signal in the spring which was one of the best decisions of my Penn experience!)"
  ],
  "leapsOfFaith": [],
  "advice": [],
  "email": "krentala@sas.upenn.edu",
  "name": "Kaitlyn Rentala",
  "class": "2022",
  "type": "curf",
  "linkedIn": "https://www.linkedin.com/in/kaitlyn-rentala/",
  "shortBio": "Kaitlyn is a senior in the College of Arts and Sciences studying Philosophy, Politics, Economics (PPE). At Penn, Kaitlyn spent most of her time in the legal studies department, boring her (mostly non-humanities) friends about philosophy and law, and hanging out with her Signal family! She will be working in consulting in Washington DC post-graduation before (hopefully!) pursuing a JD/PhD in philosophy.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202022-04-13%20at%2010.04.11%20PM.png"
},
{
  "_id": {
    "$oid": "6202a8ae4c10a915e23e288e"
  },
  "companiesRejectedFrom": [
    "Nsf grfp (1st time applying)",
    "Knight-hennessy fellowship",
    "Stanford",
    "IBM",
    "MIT lincoln labs",
    "Intel"
  ],
  "thingIsworeIdFinish": [
    "Worked for years as a kid learning to code video games to eventually make an official game/app, but I never made one"
  ],
  "everydayLs": [],
  "memoriesImade": [],
  "thingsLearnt": [
    "'learn how to do things you don't want to do as if they are things you do want to do'"
  ],
  "booksForFun": [],
  "thingsProudOf": [
    "That I smile very often now"
  ],
  "unconventionalSkills": [
    "Can do an eyebrow wave"
  ],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [
    "Pandemic starting during my senior year of undergrad"
  ],
  "quirks": [],
  "comfortZone": [
    "Throwing parties",
    "Joined a dance team",
    "Created a sports group",
    "Learning/trying new things academically/in research",
    "Hosted live videos on social media"
  ],
  "endOfTheWorld": [
    "Lost my 4.0 in 2nd year undergrad by 2 points on a final",
    "Failed and retook 2 classes in undergrad"
  ],
  "leapsOfFaith": [],
  "advice": [
    "Stop stressing out about every little mess up because you are afraid of being unworthy, its self-sabotage to your mental health",
    "You don't have to know every little detail of what you want to do from the beginning nor do you have to stick exactly to your original plan. it's okay to be unsure and figure some things out as you go"
  ],
  "email": "mhopki3@seas.upenn.edu",
  "name": "Malakhi Hopkins",
  "class": "PhD",
  "type": "curf",
  "linkedIn": "https://www.linkedin.com/in/malakhi-hopkins-89711b1a2?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_contact_details%3BJ6rk%2FNpbSgiLwMgL7ecr6Q%3D%3D",
  "shortBio": "Malakhi is currently a 2nd year PhD Student in Electrical and Systems Engineering at Penn with a research focus on Multi-Robot Systems. Malakhi is originally from Maryland, and graduated from the University of Maryland Baltimore County in Spring 2020 where he majored in Computer Engineering.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Malakhi-Hopkins-Headshot%20-%20Malakhi%20Hopkins.jpg"
},
{
  "_id": {
    "$oid": "6202aab24c10a915e23e2893"
  },
  "companiesRejectedFrom": [
    "Dozens of congressional offices and committees",
    "Centers for medicare & medicaid services",
    "Public health management corporation",
    "Pennsylvania health law project",
    "Philadelphia futures",
    "Rhodes scholarship",
    "Marshall scholarship"
  ],
  "thingIsworeIdFinish": [
    "1 second a day videos",
    "Being pre-med",
    "10k in Philadelphia"
  ],
  "everydayLs": [],
  "memoriesImade": [
    "Sunday pancake breakfasts",
    "Clark park farmers market trips",
    "Performing in Philadelphia fringe festival"
  ],
  "thingsLearnt": [],
  "booksForFun": [
    "My goal is to add some books to this list this year"
  ],
  "thingsProudOf": [
    "I have a mug collection of over 30 mugs and counting",
    "Doing the mini time crossword everyday",
    "Waking up on time for work everyday"
  ],
  "unconventionalSkills": [],
  "thingsIwouldDoInstead": [],
  "unexpectedTwists": [],
  "quirks": [],
  "comfortZone": [],
  "endOfTheWorld": [
    "Didn't do senior theses for my majors",
    "Didn't hear back from the 30 summer internships I applied for my freshman year",
    "Rejected from my dual degree program when I applied to Penn in high school"
  ],
  "leapsOfFaith": [
    "Quit the first job I had out of college, but ended up in a new job I loved",
    "Auditioning for theatre shows",
    "Adopting the cutest dog."
  ],
  "advice": [
    "Have a plan, but don't fret if (and when) it doesn't pan out",
    "Ask for help whenever you need it",
    "It takes effort to maintain friendship, but it is so worth it",
    "Covid is going to hit you senior spring, get ready and prepare!"
  ],
  "email": "louislin103@gmail.com",
  "name": "Louis Lin",
  "class": "2022",
  "type": "curf",
  "shortBio": "Louis Lin is a 2022 Master of Public Health Student at the Perelman School of Medicine and a 2020 graduate of the College where he studied Health and Societies and Political Science. As an MPH student, he also works at Philadelphia Legal Assistance as the Eviction Diversion Project Coordinator. He starts law school in the Fall of 2022.",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202022-02-08%20at%202.11.14%20PM.png"
}]