[{
  "_id": {
    "$oid": "60608468ad4f930ff55c1dd3"
  },
  "coursesTaught": [
    "MGMT111"
  ],
  "companiesRejectedFrom": [
    "The first time I applied to PhD programs, I was rejected from every single program. I tried again a year later and was accepted into six."
  ],
  "thingIsworeIdFinish": [],
  "everydayLs": [
    "Not being able to wake up to alarms",
    "Forgetting where I put my keys",
    "Forgetting to turn lights off",
    "Banging elbows/knees/shoulders against walls or furniture due to clumsiness"
  ],
  "memoriesImade": [
    "Traveling the world",
    "Cooking new recipes",
    "Enjoying the outdoors",
    "Spending time with friends and family",
    "Learning a new language",
    "Riding rollercoasters",
    "Skiing"
  ],
  "thingsLearnt": [
    "If you don't make time for the things you care about now, you never will...life only gets more crazy",
    "You're not alone",
    "Everyone feels like an imposter at least sometimes, and everyone experiences failure",
    "Taking time off will actually make you more productive, and is important for mental health"
  ],
  "booksForFun": [
    "The Man Who Loved Dogs",
    "Anxious People",
    "My Sister, the Serial Killer",
    "The Warmth of Other Suns",
    "The Innovators",
    "Wild Swans",
    "A Town Like Alice",
    "Invisible Women"
  ],
  "thingsProudOf": [],
  "unconventionalSkills": [],
  "hobbies": [],
  "unexpectedTwists": [],
  "obstacles": [],
  "quirks": [],
  "comfortZone": [
    "Moved to London without a job",
    "Lived in Taiwan and China",
    "Public speaking (including teaching) despite being inherently shy"
  ],
  "endOfTheWorld": [
    "I failed the midterm for both Linear Algebra and Econometrics, after which some people told me that perhaps I wasn’t “good at math”. I initially thought they might be right and was incredibly discouraged. But I didn’t give up, and now I use Econometrics daily in my research."
  ],
  "leapsOfFaith": [],
  "studentsKnow": [],
  "advice": [
    "Don't worry about veering off the 'beaten path'. As an undergraduate, I wanted a plan for what my life would look like (I am very Type A personality), but I also didn't know what I wanted to do or who I wanted to be. I needed time--and to leave my comfort zone--to learn who I was and what I wanted."
  ],
  "other": [],
  "email": "bglennon@wharton.upenn.edu",
  "name": "Britta Glennon",
  "department": "Management",
  "position": "Assistant Professor",
  "shortBio": "Britta Glennon is an Assistant Professor in the Management Department at the Wharton School and an NBER Faculty Research Fellow. Her research is at the intersection of innovation, immigration, and international business and has been featured in media outlets such as The Economist, the Wall Street Journal, Forbes, and Bloomberg. She teaches MGMT111 (Multinational Management).",
  "linkedIn": "",
  "personalWebsite": "http://brittaglennon.com/",
  "publicEmail": "bglennon@wharton.upenn.edu",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/BGlennon_Portrait%20%281%29%20-%20Britta%20Glennon.jpg"
},
{
  "_id": {
    "$oid": "6060853aad4f930ff55c1dd4"
  },
  "coursesTaught": [
    "The History of American Animation; The Animation of Disney; The History of Children's Television"
  ],
  "companiesRejectedFrom": [
    "NBC",
    "ABC",
    "CBS",
    "Viacom",
    "Nickelodeon",
    "Turner",
    "PBS"
  ],
  "thingIsworeIdFinish": [
    "Being fluent in another language",
    "My book of comics",
    "Learning to play classical guitar",
    "My Antonia by Willa Cather"
  ],
  "everydayLs": [],
  "memoriesImade": [
    "Hanging out with colleagues at airports waiting for flights turns out to be a bonding experience"
  ],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [
    "Sitar player",
    "Played in a performance art band with Mo Willems",
    "Board Member and performer in Elevator Repair Service (theater ensemble) in the 1990s",
    "Enthusiastic cartoon viewer since the age of three",
    "Sat next to Hank Aaron at the Oscars dinner"
  ],
  "unconventionalSkills": [
    "Editing mixtapes and playlists for friends",
    "Beatles fan",
    "Maker of birthday cards"
  ],
  "hobbies": [
    "Learning Mandolin and Ukulele"
  ],
  "unexpectedTwists": [
    "Thought I would be at PBS for two years at most, but I’ve been there 17 years"
  ],
  "obstacles": [],
  "quirks": [
    "Make lists for everything",
    "Drink tea constantly",
    "Eat grapefruit for breakfast every morning",
    "Have a very short attention span",
    "Will not drive on highways"
  ],
  "comfortZone": [
    "Gave presentations using a teleprompter",
    "Did a TEDx talk at Penn",
    "Drove on Route 22 in NJ"
  ],
  "endOfTheWorld": [
    "Produced many questionable pilots and series that no one remembers"
  ],
  "leapsOfFaith": [
    "Convinced Cartoon Network to greenlight The Powerpuff Girls after it tested horribly in focus groups",
    "Took a two-level title cut to work at PBS KIDS"
  ],
  "studentsKnow": [
    "I attended Penn in the 1980s, and while it has changed over the years, it hasn't changed that much",
    "I fell asleep in any class that turned out the lights and showed slides",
    "I drew in my notes",
    "I was part of the group that started throwing toast at football games in 1984"
  ],
  "advice": [
    "Have more fun",
    "Leave Penn with at least five funny stories to tell",
    "Get more sleep",
    "Don’t worry so much",
    "Get to know your professors and stay in touch with them"
  ],
  "other": [],
  "email": "lindasim@sas.upenn.edu",
  "name": "Linda Simensky",
  "department": "Cinema and Media Studies",
  "position": "Visiting Professor of Cinema Studies",
  "shortBio": "As the Head of PBS KIDS Content, Linda Simensky oversees programming, development and current series, and content strategy. Before joining PBS, Linda was Senior Vice President of Original Animation for Cartoon Network, where she oversaw development and series production of 'The Powerpuff Girls', among others. She began her career working for nine years at Nickelodeon, where she helped build the animation department and launch the popular series 'Rugrats','Doug' and 'The Ren & Stimpy Show'. Linda is a frequent speaker and writer on the topic of children’s programming; she has presented at numerous animation and television conferences and her work has appeared in several books on animation and children’s media. Linda attended the University of Pennsylvania, where she majored in Communications and minored in History. She received her MA from NYU in Neil Postman's Media Ecology program. She teaches courses on animation history in Cinema and Media Studies at the University of Pennsylvania.",
  "linkedIn": "https://www.linkedin.com/in/lindasimensky/",
  "personalWebsite": "",
  "publicEmail": "lindasim@sas.upenn.edu",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Linda+5+Color.jpeg"
},
{
  "_id": {
    "$oid": "6058890b152ff57a80886858"
  },
  "coursesTaught": [
    "CIS 110"
  ],
  "companiesRejectedFrom": [
    "MIT's PhD Program",
    "Berkeley's PhD Program",
    "A fashion technology startup job",
    "A data visualization journalist position at pudding.cool"
  ],
  "thingIsworeIdFinish": [],
  "everydayLs": [
    "I'm far more productive in the mornings, but I have the hardest time getting out of bed day to day"
  ],
  "memoriesImade": [
    "Road tripping with two friends from Houston to Philadelphia, even getting stranded in Tennessee for two days",
    "Going to concerts with friends"
  ],
  "thingsLearnt": [],
  "booksForFun": [
    "Carceral Capitalism by Jackie Wang",
    "The Witcher novels by Andrzej Sapkowski"
  ],
  "thingsProudOf": [
    "I learned how to ride a bike at the age of 23"
  ],
  "unconventionalSkills": [
    "I think I could beat anybody one-on-one at Mario Super Sluggers"
  ],
  "hobbies": [
    "Having learned guitar as a kid, I've enjoyed teaching myself how to play other instruments"
  ],
  "unexpectedTwists": [],
  "obstacles": [],
  "quirks": [],
  "comfortZone": [
    "Doing a very bad job on take-home work for a job interview and still showing up to present that very bad work (I didn't get the job)"
  ],
  "endOfTheWorld": [
    "Not getting into any PhD programs on my first round of applications"
  ],
  "leapsOfFaith": [
    "Spending a summer working as a TA for an intensive data journalism program despite never having done much in data or journalism before"
  ],
  "studentsKnow": [
    "When I say I'm here for you, I really do mean it"
  ],
  "advice": [
    "Don't be afraid to make a choice and commit to it, especially since you can usually change your mind later"
  ],
  "other": [],
  "email": "sharry@seas.upenn.edu",
  "name": "Harry Smith",
  "department": "Computer and Information Science",
  "position": "Lecturer",
  "shortBio": "Harry is a Lecturer in the Engineering School's Department of Computer Science. He has taught CIS 110 for his first two semesters at Penn, and is looking forward to branching out to other courses over time. Aside from teaching, Harry is interested in data visualization and creative computing.",
  "linkedIn": "",
  "personalWebsite": "https://www.ourpropeller.com",
  "publicEmail": "sharry@seas.upenn.edu",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/prof_photo%20-%20Harry%20Smith.jpg"
},
{
  "_id": {
    "$oid": "60588a9f152ff57a8088685b"
  },
  "coursesTaught": [
    "MGMT 238: Organizational Behavior and  MGMT 610: Foundations of Teamwork and Leadership"
  ],
  "companiesRejectedFrom": [
    "College: rejected by both Princeton and Yale",
    "First week at Harvard: failed the required writing exam and was recommended an extra semester of remedial writing",
    "First faculty job: rejected by UVA because 'you won't be able to teach our MBAs'",
    "Academic papers: more than five dozen rejections and counting",
    "First book: had to throw away 102,000 words and start over from scratch",
    "First application to speak at TED: denied because I wasn't a good enough speaker",
    "Application to write for The Daily Show: rejected because my packet wasn't well-structured or well-organized"
  ],
  "thingIsworeIdFinish": [
    "Submitting another packet to The Daily Show",
    "Trying out standup comedy and improv"
  ],
  "everydayLs": [
    "Running late, almost every day, for almost everything"
  ],
  "memoriesImade": [],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [],
  "unconventionalSkills": [],
  "hobbies": [],
  "unexpectedTwists": [],
  "obstacles": [],
  "quirks": [],
  "comfortZone": [
    "Taking a bus from Boston to Mexico City...and back"
  ],
  "endOfTheWorld": [
    "Being rejected by TED",
    "Being told I couldn't teach MBAs",
    "Losing my campaign for the presidency of Harvard Student Agencies",
    "Missing my best dive in the state championships my senior year and falling short of my 4-year goal to be all-state",
    "Getting cut from high school soccer tryouts",
    "Not making the middle school basketball team three years in a row"
  ],
  "leapsOfFaith": [],
  "studentsKnow": [],
  "advice": [
    "Don't be so goal-oriented; it can give you tunnel vision",
    "Keep your peripheral vision open for new opportunities and relationships",
    "The moments you'll miss the most are the late nights in the dining hall playing Anagrams and debating the meaning of life"
  ],
  "other": [],
  "email": "adam@adamgrant.net",
  "name": "Adam Grant",
  "department": "Wharton",
  "position": "The Saul P. Steinberg Professor of Management and Professor of Psychology",
  "shortBio": "Adam Grant is an organizational psychologist, the author of THINK AGAIN, and host of the TED podcast WorkLife.",
  "linkedIn": "www.linkedin.com/in/adammgrant/",
  "personalWebsite": "www.adamgrant.net",
  "publicEmail": "",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/AdamGrant2019bio%20-%20Adam%20Grant.jpg"
},
{
  "_id": {
    "$oid": "605887c6152ff57a80886855"
  },
  "coursesTaught": [
    "Creative Nonfiction Workshop (ENGL135 and ENGL145)"
  ],
  "companiesRejectedFrom": [
    "A New York Times Magazine editor position",
    "Seven Days staff writer",
    "NEA Fellowship",
    "Yaddo",
    "Cullman Center Fellowship",
    "Camargo Residency",
    "Bunting Fellowship",
    "Open Society Fellowship",
    "Hodder Fellowship"
  ],
  "thingIsworeIdFinish": [
    "Writing a book on Montclair, New Jersey",
    "Writing a book on a mysterious murder in rural Georgia",
    "Writing a book on quilts",
    "Writing a children's book about a grandmother who goes fishing"
  ],
  "everydayLs": [
    "I only use my pandemic gym (the basement) once a week (if that)",
    "I can't quit Cheez-Its",
    "I forget to take my vitamins at least twice a week",
    "I don't drink enough water",
    "The dog needs a bath",
    "I want to boycott Amazon but don't"
  ],
  "memoriesImade": [],
  "thingsLearnt": [
    "Tomorrow is not promised to you",
    "Breathing is important",
    "If you're in a whirling vortex of anxiety, the best thing to do is to just slow it all down"
  ],
  "booksForFun": [
    "Washington Black",
    "Brotherly Love",
    "The View from Breast Pocket Mountain"
  ],
  "thingsProudOf": [
    "Serious skills in many of the domestic arts: cooking, baking, sewing, knitting, and gluing"
  ],
  "unconventionalSkills": [
    "Highly practical",
    "Good in a crisis",
    "Unlikely to give up"
  ],
  "hobbies": [
    "I want to add a mini trampoline to my neglected home gym",
    "I'm always interested in improving my French"
  ],
  "unexpectedTwists": [
    "Um....pandemic?"
  ],
  "obstacles": [
    "Deciding to live a creative life"
  ],
  "quirks": [
    "My decision to live a creative life",
    "Goofballery"
  ],
  "comfortZone": [
    "Living a creative life"
  ],
  "endOfTheWorld": [
    "Having my work rejected hundreds (if not thousands) of times; this is just how it is"
  ],
  "leapsOfFaith": [],
  "studentsKnow": [
    "If you trust the process and put in the work, you'll be rewarded by becoming a better writer"
  ],
  "advice": [
    "Take *at least* one gap year before college"
  ],
  "other": [],
  "email": "lisef@sas.upenn.edu",
  "name": "Lise Funderburg",
  "department": "Creative Writing Program (English)",
  "position": "Lecturer",
  "shortBio": "Award-winning writer Lise Funderburg teaches creative nonfiction at The University of Pennsylvania and leads writing workshops in venues ranging from the second floor of a Tokyo coffee shop to the yoga studio on her street to the all-too-familiar virtual classroom known as Zoom. Lise is the author of the bestselling memoir, Pig Candy: Taking My Father South, Taking My Father Home. She also authored the groundbreaking oral history, Black, White, Other: Biracial Americans Talk About Race and Identity, which was recently released in a 20th anniversary edition. Lise’s latest book is Apple, Tree: Writers on Their Parents, a collection of 25 original essays she commissioned and edited, published in 2019 by the University of Nebraska Press. Lise's essays have appeared in The New York Times, Chattahoochee Review, Cleaver, Broad Street, National Geographic, TIME, and Brevity, among other publications.",
  "linkedIn": "https://linkedin.com/in/lisefunderburg",
  "personalWebsite": "https://lisefunderburg.com",
  "publicEmail": "",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/PHOTO%20Lise%20Funderburg%20by%20Giorgia%20Fanelli%20-%20Lise%20Funderburg.jpg"
},
{
  "_id": {
    "$oid": "606cd8ba68da4906307e663f"
  },
  "coursesTaught": [
    "MKTG/STAT 476/776"
  ],
  "companiesRejectedFrom": [],
  "thingIsworeIdFinish": [
    "Writing about my non-academic, more interesting work - In the academic “publish or perish” world, we're just writing these academic journal articles that no one reads or cares about. And the more interesting stuff that we do, especially a lot of the outside activities like consulting, we rarely talk about because it’s considered a distraction, and therefore we rarely write that stuff up. I've been involved in lots of different outside projects that are way more interesting than the research that I've done. For instance with Napster, the original file-sharing music service. In 2000, it was involved in a big lawsuit, and I was an expert witness (on their side, of course). This was one of the real signature moments in my career, battling with the big evil meanies in the music industry. It was so interesting, and I would give talks on it, but I never wrote it up because I felt that people would get the wrong idea about my priorities. Plus, I only have so many words in my fingertips, so I thought I would be better focusing on my academic papers. I wish I wrote something about that grand adventure. I wish that we could be more open about some of those other non scholarly activities, because: (a) it's not like they're separated from my academic work - I was using it as the basis for my legal opinion, so it is definitely  connected. And (b), it's a hell of a lot more interesting than my regular research. So there really could be some synergy there. But we just don't do that, and I wish we did."
  ],
  "everydayLs": [
    "Not recognizing students who say hi to me outside of the classroom.I try to be folksy and familiar to my students in class, but with 200+ of them, it’s hard to do so out of context. They’ll stop me on the street and start to chat as if we’re old friends. So it’s really  embarrassing if I have no idea who they are at that moment. And it’s especially tough during COVID, since I don’t really know what people look like, and they’re wearing masks in public. All the more reason why I can’t wait for things to get back to normal.",
    "My painful addiction to Twitter. I’m disciplined enough to never touch Facebook, but I spend hours a day on Twitter."
  ],
  "memoriesImade": [],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [
    "Not sacrificing family time for my profession. I changed all the diapers for my kids, drove them to school every day, coached Little League, and so on. Maybe my priorities as a professor are a little messed up (as noted above), but daddy duty always comes first.",
    "Writing books, even though they are seen as a distraction in academia, that have made my work so much more accessible to broader audiences and pushing my colleagues to break out of the mindset that books are bad",
    "Creating a collaborative community from students I’ve had and striving to create a community of lifelong learners"
  ],
  "unconventionalSkills": [],
  "hobbies": [
    "Collecting dollar bills with interesting serial numbers (coolnumbers.com)"
  ],
  "unexpectedTwists": [],
  "obstacles": [
    "Imposter syndrome. I had never even heard of such a thing. But I remember as a PhD student (long before I got a job offer) walking around the halls of the Wharton Marketing Department, and looking at all the names on the doors, and it was like walking through the Los Angeles Dodgers locker room and seeing the names of all of these world class superstars. It was awesome to see the names of these very accomplished people whose work I had been studying as a PhD student, and then all of a sudden, to be viewed as one of them, that's a lot. You just wake up one day and you're one of them and have to start producing. As an academic, there's no one telling you what to do - outside of teaching your classes, you can do whatever you want, when you want to do it. But it's a deal with the devil, because you always have this cloud over your head 24/7, that you really should be working on this paper or that proposal. It would be better if there was someone cracking the whip and giving you deadlines. So it's a tough profession, but a very rewarding one. But there's a big dose of imposter syndrome, whether people want to admit it or not. Coming to grips with the fact that you really are doing this, and that other young, naive people have been thrown into it and have figured out how to swim, and that you're not alone in that regard - that's something that we don't talk about a lot. And for all of you as students looking at us in front of the classroom and thinking we have our shit together and we could just talk for three hours about some tiny little subject and you think how can someone do that? You'd be surprised at the frequency and depth of the insecurities that are behind that facade. It's good for students to know that most professors, I can't speak for all, but most are actually human beings. I was personally feeling imposter syndrome big time. That's why as a PhD student and a junior faculty member, I was such a total jerk, to basically try to mask that. But what I was really saying is, I don't really feel like one of you, and that persisted for years. Even through the time I got tenure, seven years in, I was always looking over my shoulder, waiting for that knock on the door for the dean to walk in my office and say, okay, Fader, the gig’s up, come on, we see through you. But then four or five years after getting tenure, when I had already been here over 10 years, I finally found my groove, and I found the stuff that I still do research on and teach in my nasty marketing models course. And I realized, I got a thing here, I can really bring something to the party, both as a scholar and a teacher. Sure there are people in the field (and in my own department) who are way smarter than I am, I can at least bring my own unique values and personality to my research and teaching. It took me ten years to find my groove but I’m glad that I’m finally comfortable with my profession and the perceptions of it.",
    "The pressures of being in a publish-or-perish world as an academic -  you can spend all this time writing a paper and really putting your heart and soul into it. Then these reviewers basically say, it's actually not that good of an idea, and the way you're pursuing it isn't all that original, and the empirical testing could be more rigorous, and oh, by the way, it's not well-written either. The academic review process is rarely a positive experience, it's all about what's wrong with this paper. It can be really, really disheartening, especially for a junior person who hasn't developed a thick skin yet. It can be almost paralyzing saying, so what do I do now? How can I recover from this? And people learn, it's super important to be in a supportive community where you can go to a senior faculty member and ask what do you make of this? It's good for students to know that beyond the flexibility of our job, it really does have its challenges. But net-net it’s a much more interesting and rewarding job than most people think."
  ],
  "quirks": [
    "I’m human to a fault in the classroom. Especially during COVID when there is literally a distance between us, I'll do so many goofy, unprofessional things. While I'm teaching, I’ll do something like bringing my son’s dog into my videos and pretending that the dog is typing on the keyboard and or my son would be out in the hallway and I’d bring him in and ask him what he thinks. So I want to do a lot of really stupid stuff or talk about my hobbies. I don’t want people to think I’m talking down to them from the cloud. I’m right here mixing it up with them."
  ],
  "comfortZone": [
    "I don’t do enough of this. I have a very narrow comfort zone, and I generally have no desire to get out of it."
  ],
  "endOfTheWorld": [],
  "leapsOfFaith": [
    "Agreeing to do a PhD. I thought it was the stupidest idea. There's one professor at MIT (Leigh McAlister) who said to me, “you ought to get a PhD in marketing”. And I said to her, “you ought to get your head checked,” but she talked me into it. I thought it was a terrible mistake, because I'm not that kind of person. And she made me come to Wharton even though I wanted to go to Harvard. I'm so glad that I listened to her (I call her my fairy godmother). But at the time, I wasn't like, okay, let's try this. Who knows? It was like, why am I doing this? Why am I subjecting myself to this “publish-or-perish” pressure? How am I gonna even pretend to be like those other people? So I had big regrets about doing it until about ten years later, when I finally realized how cool this is and how lucky I am. But at the time it was weird to make a huge career decision while feeling that I was making the wrong one. I was kind of out of control and just following instructions that some person was making me do. I was about the most reluctant professor ever. No one ever believes me, but it is so true."
  ],
  "studentsKnow": [
    "So many students look at me and see me just writing down all this math and these crazy formulas and think, how does he know all that stuff? The guy's a genius. And I don't want people to think that - not that I want them to think I’m an idiot either, but I want them to know that I'm just like them. I just have been at it for a long time. And I enjoy it. I wasn't born knowing all the stuff I teach. I learned it the hard way. Practice makes perfect!"
  ],
  "advice": [],
  "regrets": [
    "Never taking a sabbatical - I've been here 34 years now. And I've never once taken a sabbatical. I could have taken almost three full years off and done whatever I wanted to do, but I’ve never taken advantage of the opportunity. And that's dumb for so many reasons. I could have seen more of the world, I could have exposed my kids to schools in different cultures. A lot of my colleagues have done exactly that. The problem is, I enjoy life here so much I couldn't imagine being away. But I wish that I had done that, and I hope to do it before I retire.",
    "I wish I had been more adventurous and willing to try things. You name a hobby or activity or food that most normal people enjoy, but I probably don’t do it. I don't ski. I don't like golf. I'm not a foodie. I don't like art. It’s not that I dislike everything, but I just don't try new things.I’m pretty simple. It's interesting to watch my kids who used to be like me, but now they both started to ski and do more things, and I think that’s great. ",
    "Downplaying how much I’ve cared about teaching in the past. I've always cared about teaching, but around here it is often taboo to talk about it. Top priority is how many papers you’ve written, and number two is just don't suck in the classroom. So for years I played along and kept my passion for teaching on the down low. I didn't want people to misjudge me as someone whose values were messed up. But then finally, right around 2000, I realized that I have nothing to be ashamed of. Why should I be embarrassed to admit that I like teaching? So I basically said, screw it: teaching really matters to me and I won’t hide it any longer. It's not just what I do in the classroom, it's also course development and just being accessible to students, even if it has nothing to do with classes. These activities don’t have to come at the expense of research. I really think we can have it all."
  ],
  "other": [],
  "email": "faderp@wharton.upenn.edu",
  "name": "Pete Fader",
  "department": "Marketing",
  "position": "Professor of Marketing",
  "shortBio": "Pete Fader is the Frances and Pei-Yuan Chia Professor of Marketing at The Wharton School of the University of Pennsylvania. His expertise centers around the analysis of behavioral data to understand and forecast customer shopping/purchasing activities. In addition to his various roles and responsibilities at Wharton, Professor Fader co-founded a predictive analytics firm (Zodiac) in 2015, which was sold to Nike in 2018. He then co-founded (and continues to run) Theta Equity Partners to commercialize his more recent work on “customer-based corporate valuation.” He also teaches MKTG/STAT 476/776, “Applied Probability Models in Marketing.”",
  "linkedIn": "",
  "personalWebsite": "",
  "publicEmail": "",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/169156988_203603308195961_3551762419954108196_n.jpg"
},
{
  "_id": {
    "$oid": "60588b18152ff57a8088685c"
  },
  "coursesTaught": [
    "NURS375, NURS365, NURS065, and NURS623"
  ],
  "companiesRejectedFrom": [],
  "thingIsworeIdFinish": [
    "Scrapbooks of vacations and for each of my three children",
    "Decorating my mudroom with artwork made by my children"
  ],
  "everydayLs": [
    "Getting my car towed with homemade soup in the trunk",
    "Backing into a dumpster at the auto body shop after it was just fixed from a previous car accident"
  ],
  "memoriesImade": [
    "Making Italian food with my daughters",
    "Making pizzelles for holidays",
    "Training for a marathon",
    "My son teaching me how to fish",
    "Watching sunsets"
  ],
  "thingsLearnt": [
    "'Being humble means recognizing that we are not on earth to see how important we can become, but to see how much difference we can make in the lives of others.' - Gordon B. Hinckley"
  ],
  "booksForFun": [
    "How Not to Die",
    "Benjamin Franklin quotes",
    "The Secret",
    "Living, Loving, and Learning",
    "Ralph Waldo Emerson",
    "St. Ignatius Loyola"
  ],
  "thingsProudOf": [
    "My children",
    "My spirituality",
    "My commitment to kindness and honesty"
  ],
  "unconventionalSkills": [
    "I can still do a backbend and a split",
    "I like to rap and write poetry"
  ],
  "hobbies": [
    "Mastering food prep for whole food plant-based meals",
    "Growing a vegetable garden",
    "Growing lemon, olive, and fig trees"
  ],
  "unexpectedTwists": [
    "Getting pregnant just four months after marriage",
    "My husband spontaneously quitting his job to start a new business the next day",
    "The settlement for the house we bought unexpectedly falling through on the same day our old house was sold; we had no home to go to that night!"
  ],
  "obstacles": [],
  "quirks": [
    "Left handed, clumsy, and oftentimes a scatterbrain",
    "Polychronic"
  ],
  "comfortZone": [
    "Teaching at Penn",
    "Being a trivia dancer on Live with Kelly and Michael",
    "Dancing with the Professors",
    "Dancing on stage with Diana Ross"
  ],
  "endOfTheWorld": [
    "Not getting my first job out of college"
  ],
  "leapsOfFaith": [
    "Moving across the country via road trip as newlyweds"
  ],
  "studentsKnow": [
    "I love my family, food, dancing, writing poetry, running, and sunsets!"
  ],
  "advice": [
    "I wish I had a better perception of learning culture as opposed to performance culture; performance culture focuses on the end result whereas learning culture focuses on learning for the sake of learning (thoughts from Penn Professor, Adam Grant)"
  ],
  "other": [],
  "email": "dowdmo@upenn.edu",
  "name": "Monique Dowd",
  "department": "School of Nursing",
  "position": "Senior Lecturer",
  "shortBio": "Monique Dowd is a Senior Lecturer for the Nursing School's Department of Biobehavioral Health Sciences. Ms. Dowd teaches three undergraduate courses: “Fundamentals of Nutrition” (NURS65), “Case Studies in Clinical Nutrition” (NURS365), and “Nutrition in the Life Cycle” (NURS375), covering topics from pregnancy to eating disorders to special nutritional needs of the elderly. For more information, visit https://www.nursing.upenn.edu/live/profiles/169-monique-dowd. ",
  "linkedIn": "",
  "personalWebsite": "",
  "publicEmail": "dowdmo@upenn.edu",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202021-03-31%20at%205.30.32%20PM.png"
},
{
  "_id": {
    "$oid": "605888c8152ff57a80886857"
  },
  "coursesTaught": [
    "Sports Narratives, First-Person Storytelling, and Introduction to Creative Writing"
  ],
  "companiesRejectedFrom": [
    "The MFA program at the University of Iowa",
    "The MFA program at Hunter College",
    "The MFA program at the University of Minnesota",
    "The MFA program at the University of Pittsburgh"
  ],
  "thingIsworeIdFinish": [
    "My memoir (one day, I swear!)",
    "Qualifying for the Boston Marathon",
    "Submitting completed essays for publication",
    "Learning basic website design"
  ],
  "everydayLs": [
    "Spending too many hours responding to emails",
    "Not finding time to write",
    "Working too late, then eating dinner too late, then not having enough time to decompress before bed",
    "Being too strict with money"
  ],
  "memoriesImade": [
    "Exploring Philadelphia on runs and walks, both alone and with my partner and dog",
    "Watching the New England Patriots with my fellow fan-friends",
    "Biking across the country (!) with my partner",
    "Visiting family in Massachusetts, New Hampshire, and Florida",
    "Getting food & drinks with friends around Philadelphia",
    "Visiting dear friends (and their dogs) in Brooklyn",
    "Hanging out with my cat"
  ],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [
    "The impact I've made on individual students and the relationships I've had with students that have lasted long after they leave my class",
    "The bond that has formed between students in classes I've convened",
    "The 14 marathons I've run, and the many additional miles training for them!",
    "The work I've done in therapy",
    "How many push-ups I can do"
  ],
  "unconventionalSkills": [],
  "hobbies": [],
  "unexpectedTwists": [],
  "obstacles": [
    "My mom suffered from mental health disorders and substance abuse, and she died by suicide when I was twelve years old; I don't think this is exactly something that one \"overcomes,\" but this experience has undoubtedly shaped me, and I believe it is in large part why I've been so drawn to working with student writers"
  ],
  "quirks": [],
  "comfortZone": [],
  "endOfTheWorld": [
    "I got a D in statistics",
    "I lost my election for class president by two votes in 9th grade",
    "I didn't get an internship at the Kelly Writers House when I applied as an undergraduate",
    "Races where I didn't hit my time goal"
  ],
  "leapsOfFaith": [],
  "studentsKnow": [],
  "advice": [
    "Be patient",
    "Be kind to yourself and gentle with yourself",
    "You are enough",
    "Ask for what you need",
    "Take out a loan to cover your living expenses so you don't have to work 20-30 hours a week and still stress over money!",
    "Don't let that boy treat you that way",
    "Don't take statistics"
  ],
  "other": [],
  "email": "jjossely@writing.upenn.edu",
  "name": "Jamie-Lee Josselyn",
  "department": "Center for Programs in Contemporary Writing",
  "position": "Associate Director & Instructor",
  "shortBio": "Jamie-Lee Josselyn is the Associate Director for Recruitment for the Center for Programs in Contemporary Writing, an instructor in the Creative Writing Program, and the Director of the Summer Workshop for Young Writers at the Kelly Writers House. She teaches the multi-genre writing workshop Sports Narratives as well as other courses on creative nonfiction writing. Jamie-Lee has published writing in The New Republic, Literary Hub, Cleaver Magazine, and elsewhere, and she is the host of the literary podcast series Dead Parents Society.",
  "linkedIn": "",
  "personalWebsite": "",
  "publicEmail": "jjossely@writing.upenn.edu",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202021-03-23%20at%201.20.19%20PM.png"
},
{
  "_id": {
    "$oid": "60588a4d152ff57a8088685a"
  },
  "coursesTaught": [
    "Making Sense of Science, The Math That Shapes Our Lives, Scientific Nationalism in Japan, Physics of Everyday Life, and Policing Social Media and its Impact"
  ],
  "companiesRejectedFrom": [
    "Too many to list!",
    "I've applied to countless (over 100 over the years) postdoctoral research positions while only being offered a job by a small handful, and never offered a (physics) faculty position"
  ],
  "thingIsworeIdFinish": [
    "...my homework for a class on supersymmetry in graduate school, despite being related to my dissertation (I believe the written evaluation I received mentioned my promises that I would turn in the homework soon, and I still have pieces of it somewhere)",
    "Learning the guitar",
    "Lots of books, like Infinite Jest"
  ],
  "everydayLs": [
    "Biking when I think it won't rain (or taking the bus when I think it will) and usually being wrong",
    "My inability to go to bed before 1-2 am or wake up except for at the last minute for something",
    "Shamefully not finishing the last of food products and leftovers",
    "Too much sugar they say",
    "Deadlines"
  ],
  "memoriesImade": [
    "Running into friends randomly in Center City",
    "Talking to my great neighbors",
    "Training at an aikido dojo and having lunches after Saturday class",
    "Chasing my cat around"
  ],
  "thingsLearnt": [
    "Physics, though I hope big revolutions come soon",
    "Programming",
    "Presenting and speaking in front of groups",
    "How to learn and question"
  ],
  "booksForFun": [
    "Humankind by Rutger Bregman",
    "The Witcher book series by Andrzej Sapkowski",
    "Malazan Book of the Fallen series by Steven Erikson",
    "The Expanse series by James S. A. Corey",
    "The Broken Earth Trilogy by N. K. Jemisin",
    "Midnight in Chernobyl by Adam Higginbotham"
  ],
  "thingsProudOf": [
    "Vegan cooking and baking",
    "My recent success at not keeping browser tabs open",
    "Inbox Zero (usually)",
    "Teaching my cat tricks like a fist bump",
    "Folding a fitted sheet (sometimes)",
    "Being a martial artist",
    "Completing NaNoWriMo"
  ],
  "unconventionalSkills": [
    "My ability to stay awake",
    "Remembering random articles I've read online once",
    "Recognizing voice actors"
  ],
  "hobbies": [
    "Virtual reality",
    "Climbing",
    "Baking bread"
  ],
  "unexpectedTwists": [
    "Publishing an essay on failing in academia to then be asked about applying for an academic job (the one I still do!)"
  ],
  "obstacles": [
    "Moving many times as an adult to start over in a new place",
    "Leaving academia as a physicist after not getting a faculty job"
  ],
  "quirks": [
    "Obsessing over random computer problems",
    "Smelling my food before I take a bite",
    "Lots of silly foibles I keep hidden away"
  ],
  "comfortZone": [
    "Moved to a different country and across the US",
    "Rafted the Grand Canyon",
    "Skiing",
    "Climbed Mount Fuji at night"
  ],
  "endOfTheWorld": [
    "Nearly any grade, assignment, or exam that didn't go well",
    "Not getting onto the basketball team in middle school"
  ],
  "leapsOfFaith": [
    "Moving to Japan for my first postdoc",
    "Just traveling and working on random projects for a year after not getting a faculty job",
    "Moving to Philadelphia to teach writing"
  ],
  "studentsKnow": [
    "I want more than anything for them to succeed and be comfortable approaching me (I don't bite!)",
    "I'm actually quite shy",
    "That I've stumbled all the way to where I am but am (mostly) better for it"
  ],
  "advice": [
    "Don't be afraid to ask for help",
    "Go to office hours",
    "Get more sleep",
    "Try new things",
    "That 9 am sculpture class is indeed cool but is too early for you",
    "Don't run across campus in flip-flops after being up all night",
    "Stay in touch with people"
  ],
  "other": [],
  "email": "kehayias@sas.upenn.edu",
  "name": "John Kehayias",
  "department": "The Marks Family Center for Excellence in Writing",
  "position": "Lecturer in Critical Writing",
  "shortBio": "John Kehayias is currently a Lecturer in Critical Writing in The Marks Family Center for Excellence in Writing. His background is in physics and mathematics, with a BA in both from Columbia University and a PhD in physics from the University of California, Santa Cruz. His previous research work was in theoretical particle physics including topics like supersymmetry, dark matter, gravity, and cosmology. Now teaching writing seminars at Penn, he frequently teaches seminars focusing on understanding and communicating science and math and their role in our society.",
  "linkedIn": "",
  "personalWebsite": "https://9bladed.com",
  "publicEmail": "kehayias@sas.upenn.edu",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/Screen%20Shot%202021-03-23%20at%201.25.34%20PM.png"
},
{
  "_id": {
    "$oid": "606e1a640bf104c5bb718fb3"
  },
  "coursesTaught": [
    "CIS 160, CIS 121"
  ],
  "companiesRejectedFrom": [
    "10 out of the 12 grad schools I applied to for my master’s turned me down. When I was applying for my PhD, on the GRE I could not finish a section and if one doesn’t finish a certain number of questions, one gets a N.S. for no score. Despite that, I still was accepted to a few programs."
  ],
  "thingIsworeIdFinish": [
    "My PhD at Washington University in St. Louis - I transferred to Maryland to finish."
  ],
  "everydayLs": [],
  "memoriesImade": [
    "Chatting with friends",
    "Cooking for friends and family",
    "Playing squash with my daughter"
  ],
  "thingsLearnt": [
    "Cooking! We all need to eat! It is a very, very important skill everyone should learn. Even if you just know ten solid dishes, that is enough. Whatever age you are, you have to cook, and eating a good, healthy meal is important for everyone. Maybe I should offer a cooking class in Towne 100!"
  ],
  "booksForFun": [],
  "thingsProudOf": [
    "Calling the students I’m working with often (a few times each week). Each student is a project, and I’m in very close touch with them until we accomplish the goal for that student. In most cases, it is at least two years.",
    "Working with students who come from relatively “unknown” institutes and creating opportunities for them.",
    "Working with high school students - when I started, most people discouraged me from doing this, but I care, so I did it."
  ],
  "unconventionalSkills": [
    "Memorizing names"
  ],
  "hobbies": [
    "My interest in cooking has really grown during the pandemic.",
    "I’ve always liked sports, but don’t have much time for it these days.",
    "I love fresh produce and fresh fruits. I go to great lengths to get the best produce I can. I told a farmer he should grow San Marzano tomatoes and the farmer had never heard of them and said what if I grow them and nobody buys them? I said, I will buy your entire crop, even though I know that will not happen. And then he started growing them, and now I have to give up my share of tomatoes because the whole world wants the tomatoes! I have been going to farmers and farmers’ markets and getting good produce not only for me and my family but also for friends. For years, I have gotten produce for a few of my friends each week."
  ],
  "unexpectedTwists": [
    "Getting a PhD",
    "Starting a high school program for students",
    "Getting the opportunity to teach at Penn"
  ],
  "regrets": [],
  "obstacles": [
    "When I started my PhD at Washington University St. Louis, things didn’t go smoothly for the first couple of years. I had the option of quitting and going back to industry, and I realized I really wanted to finish a PhD and didn’t want to be a counterexample for others who may be looking to pursue one, so I transferred to Maryland to finish. I had decided to transfer in July, and if I waited for the normal app cycle I had to wait a whole other year, but I didn’t want to spend another year doing nothing. I emailed a few faculty members I really wanted to work with and asked if we could talk. And that is how I got into Maryland where I eventually moved and finished my PhD."
  ],
  "quirks": [],
  "comfortZone": [
    "Giving up my job at Qualcomm and a lot of money to pursue a PhD, especially when I got off to a rocky start in the first couple of years. It was probably the lowest point in my career after having a great life going that I’d given up.",
    "Learning how to do research. Nobody had taught me how to do this in college and reading a research paper at first was a challenge, so I had to learn all this on my own."
  ],
  "endOfTheWorld": [
    "As an undergraduate, I cared a lot about grades and none of those things matter at all. I’ve gotten many very poor scores on exams and I don’t remember most of my grades (an indication that they are not important). When I was at Wash U, one of my very good friends was getting married. I wanted to go, but I had a very important exam the next day. I told a colleague that I couldn’t go because of that, and he turned to me and said, “Rajiv, twenty years from now you will always remember you didn’t attend your friend’s wedding. But ask yourself, will you remember the score on this exam twenty years from now?” And that answered the question of whether I should go to the wedding or not, and that second I decided I was going. I went to the wedding, and I actually also ended up doing well in the exam. That advice has always stayed with me - ask yourself what will be important twenty years from now."
  ],
  "leapsOfFaith": [
    "Working with high school students when I wasn’t even tenured. I was told by many that people will not care about your work with high school students, it will not matter, it will not go on your resume, but it is a big part of what I do now, and a number of my high school students are now very successful and in top PhD programs, so I am very happy that I did that."
  ],
  "studentsKnow": [],
  "advice": [
    "Ask for help! It doesn’t make you a weak person. I am able to do whatever I am able to now only because a LOT of people have helped me along the way. Nobody I know does everything on their own. If some people say no, it doesn’t mean you should stop asking for help.",
    "Build strong relationships. Relationships should not be based on what you can do for someone else or what they can do for you.",
    "Be a bit fearless. Life is a journey. Who is to say that someone has a better career than someone else? It is my journey, and that is your journey. To me, success is only about what makes you happy. It is not a competition. Be fearless in making decisions. By being guarded of your GPA or what the world thinks of you, you forget what you want to do that will keep you happy."
  ],
  "other": [],
  "email": "rajivg@camden.rutgers.edu",
  "name": "Rajiv Gandhi",
  "department": "Computer and Information Science",
  "position": "Lecturer",
  "shortBio": "Rajiv is a CIS professor who has taught CIS160 and CIS121 at Penn and also teaches at Rutgers University Camden. He does research on the design and theoretical/experimental analysis of algorithms and is passionate about working with high school and college students to help them achieve their full potential.",
  "linkedIn": "",
  "personalWebsite": "",
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/rajiv%20-%20O%20O%27Dwyer.jpeg",
  "publicEmail": "",
  "__v": 0
},
{
  "_id": {
    "$oid": "60588982152ff57a80886859"
  },
  "coursesTaught": [
    "WRIT039: The Politics of Poetry, WRIT039: Uncreative Writing, WRIT030: The Art of Persuasion, WRIT030: Hello, World, and ENGL010: The Company We Keep"
  ],
  "companiesRejectedFrom": [],
  "thingIsworeIdFinish": [
    "Unpacking my boxes and boxes of chapbooks",
    "Finishing my daughter's baby book",
    "Starting my son's baby book",
    "Donating all the once-trendy jeans I no longer wear"
  ],
  "everydayLs": [],
  "memoriesImade": [
    "'Lunch club' with my amazing Critical Writing colleagues between classes",
    "Social action chats with students on Locust Walk",
    "Exploring Van Pelt stacks and special collections",
    "An invited talk at Philo",
    "Take Your Professor to Lunch days with beloved students",
    "Talking about why it might be okay to still love Sylvia Plath",
    "So many conversations and readings and hugs in the Kelly Writers House Arts Cafe"
  ],
  "thingsLearnt": [],
  "booksForFun": [],
  "thingsProudOf": [
    "A very detailed spreadsheet listing the memorabilia that makes up my extensive Charles Barkley collection"
  ],
  "unconventionalSkills": [],
  "hobbies": [
    "The many ways of being a mom on TikTok"
  ],
  "unexpectedTwists": [],
  "obstacles": [],
  "quirks": [
    "Difficulty pronouncing the 'R' sound in words when I am very nervous or very excited",
    "Overpreparing for any themed event and over-decorating for holidays and birthdays"
  ],
  "comfortZone": [],
  "endOfTheWorld": [
    "I never earned myself a seat in Richard Stern's fiction writing workshop at UChicago with the future great American novelists"
  ],
  "leapsOfFaith": [
    "Moving from Iowa City to Philadelphia to work as the assistant to the Director at the Kelly Writers House with the inimitable Al Filreis and Jessica Lowenthal, who have become mentors and crucial supporters of all the work I've done at Penn"
  ],
  "studentsKnow": [
    "I did show up to Zoom as an actual cat once in honor of the viral lawyer/cat video",
    "I will find things about your writing to be excited about"
  ],
  "advice": [
    "See what happens if you don't start the paper the night before"
  ],
  "other": [],
  "email": "taransky@writing.upenn.edu",
  "name": "Michelle Taransky",
  "department": "Critical Writing & Creative Writing",
  "position": "Lecturer",
  "shortBio": "Michelle Taransky received a BA in English with honors from The University of Chicago and an MFA from the Iowa Writers’ Workshop, where she was a Truman Capote Fellow. The author of Sorry Was In The Woods (2013), Barn Burned, Then (2009), and winner of the Omnidawn Poetry Prize selected by Marjorie Welish, Factory Hollow Press recently published her chapbook Abramowitz-Grossberg (2020). Since coming to Penn to work at the Kelly Writers House in 2008, Taransky continues to run a longstanding reading series at Kelly Writers House, work as a Reviews Editor for the poetics journal Jacket2, and appear as a regular guest on the popular poetry podcast series PoemTalk, hosted by Al Filreis. In 2014, she was awarded the Beltran Award for Innovative Teaching and Mentoring at Penn. Recent courses include 'The Politics of Poetry' writing seminar and a creative writing workshop, 'The Company We Keep'",
  "linkedIn": "",
  "personalWebsite": "",
  "publicEmail": "taransky@writing.upenn.edu",
  "__v": 0,
  "profilePicUrl": "https://anti-resume-photos.s3.us-east-2.amazonaws.com/faculty-pw-michele-taransky%20-%20Michelle%20T%20K.png"
}]