[
    {
        "background_image": "https://i.ibb.co/ykYWhjD/antiresume-cover-large.png",
        "title": "Anti-Resume",
        "subtitle": "Failure at Penn",
        "link": "/antiresume",
        "description": "The Anti-Resume project's goal is to highlight both failures/accomplishments of Penn alumni that wouldn’t normally show up on a resume, and to promote the message that we are more than our resume/GPA/internship/job. We want to encourage people to learn from their failures and to celebrate the things about themselves that aren’t linked to traditional measures of success."
    },
    {
        "background_image": "https://i.ibb.co/7QWPyds/locust-confessions.png",
        "title": "Confessions on Locust",
        "subtitle": "Confesisng on Locust",
        "link": "/confessions",
        "description": "Confessions on Locust is a series of exhibits and videos that encourage the Penn community to slow down and reflect on the Penn experience. Look out for our chalk circles or LOVE Statue exhibits!"
    },
    {
        "background_image": "https://a.storyblok.com/f/64062/3500x2333/5d62f86b90/upenn-1.jpg/m/",
        "title": "Dear Penn Freshmen",
        "subtitle": "Letters of Advice",
        "link": "https://dearpennfreshmen.org/",
        "description": "\"Dear Penn Freshmen\" is a collection of letters written by Penn upperclassmen addressing their freshman year selves about things they wish they knew in their first year. These notes are filled with advice, anecdotes, and random thoughts in hopes that our experiences will make readers' first year at Penn just a tad bit easier. "
    },
    {
        "background_image": "https://i.ibb.co/F8XJ4gN/IMG-4968-Angela-Wu.jpg",
        "title": "Penn Through my Eyes",
        "subtitle": "Candid Expressions",
        "link": "/throughmyeyes",
        "description": "If we give you this camera, can you take some photos and pass it on to another Penn student? Our goal is to engage the Penn community in a shared activity: taking snapshots of our lives and passing the camera onwards!"
    },
    {
        "background_image": "https://i.ibb.co/1C0rb6g/swm.jpg",
        "title": "Squirrels without Morality",
        "subtitle": "Penn!! Games!!",
        "link": "https://swithoutm.com/",
        "description": "Squirrels without Morality is a fun little Cards against Humanity clone through which Penn students can mess around a little and stay on top of Penn-centric slang. Online version is out and in person decks coming soon!"
    },
    {
        "background_image": "https://i.ibb.co/nxxzLFM/pennbti.png",
        "title": "PennBTI",
        "subtitle": "Test & Match",
        "link": "https://www.pennbti.com/",
        "description": "A reworked version of the Myers-Briggs Type Indicator, PennBTI is a tool that allows Penn students to get their personality type and match with other students who are similar. Students can create and join any room, each of which is another chance to meet someone new!"
    },
    {
        "background_image": "https://i.ibb.co/4S7zrfL/hotones-1.png",
        "title": "Hot Ones",
        "subtitle": "Trying hot wings and telling stories",
        "link": "https://www.youtube.com/watch?v=cTiS04fbnLE",
        "description": "Based on the format of the popular YouTube Series with the same name, Hot Ones is a Penn-Centric video project where upperclassmen share their unique experiences and fascinating stories. Faced with 10 spicy hot sauces from the original show, and 10 even spicier questions, we aim to take a look at their pure, unfiltered insights into life at Penn, Pre-Professionalism, and wisdom on how to balance the components of school."
    },
    {
        "background_image": "https://i.ibb.co/DYL1zNv/stand-cover-large.png",
        "title": "Where we Stand",
        "subtitle": "Do all Penn students think the same?",
        "link": "https://www.youtube.com/watch?v=BFltwYHoUvo",
        "description": "This year, we are working to produce videos inspired by the Jubilee Spectrum series with Penn students as participants. Students from a specific community will be asked to express their opinions on a spectrum (from strongly agree to strongly disagree), regarding several stereotypes and beliefs about/within their community. They will then be prompted to discuss their responses. We aim to uncover the diverse beliefs within an individualized group, and to break down stereotypes in the process."
    },
    {
        "background_image": "https://i.ibb.co/fpR0RFx/pathways-cover-large.png",
        "title": "Deconstructing Penn Pathways",
        "subtitle": "Penn student outcomes 😲😲",
        "link": "/deconstructing-penn-pathways",
        "description": "During the spring of 2018, we used student career and internship data provided by Penn Career Services to create a visualization of the different paths that the Class of 2017 pursued over their four years at Penn. In the visualization, bands of varying width represent the number of students that entered a certain field each year. The purpose was to find out what students of each school did at their jobs and summer internships and whether or not preconceptions about the 'most popular industries' were true. The resulting product showed a surprising amount of diversity in the paths chosen by students, with the largest bands in each school being Other, indicating that there are many more students that pursue less mainstream paths than expected. We shared these results with the Penn community in the hopes of providing students with more insight and background while they consider future professional opportunities."
    }
]