[
    {
        "background_image": "https://i.ibb.co/ykYWhjD/antiresume-cover-large.png",
        "title": "Anti-Resume",
        "subtitle": "Failure at Penn",
        "link": "/antiresume",
        "description": "The goal of this project is to highlight both failures and accomplishments of people at Penn that wouldn’t normally show up on a resume, and to promote the message that we are more than our resume, our GPA, our internship, or our job. The Signal is currently sharing anti-resumes of Penn alumni and students in an effort to promote discussion and reflection on what failure really means."
    },
    {
        "background_image": "https://i.ibb.co/4S7zrfL/hotones-1.png",
        "title": "Hot Ones",
        "subtitle": "Trying hot wings and throwing up",
        "link": "https://www.youtube.com/watch?v=cTiS04fbnLE",
        "description": "Based on the format of the popular YouTube Series with the same name, Hot Ones is a Penn-Centric video project where upperclassmen share their unique experiences and fascinating stories. Faced with 10 spicy hot sauces from the original show, and 10 even spicier questions, we aim to take a look at their pure, unfiltered insights into life at Penn, Pre-Professionalism, and wisdom on how to balance the components of school."
    },
    {
        "background_image": "https://i.ibb.co/DYL1zNv/stand-cover-large.png",
        "title": "Where we Stand",
        "subtitle": "Do all Penn students think the same?",
        "link": "https://www.youtube.com/watch?v=BFltwYHoUvo",
        "description": "This year, we are working to produce videos inspired by the Jubilee Spectrum series with Penn students as participants. Students from a specific community will be asked to express their opinions on a spectrum (from strongly agree to strongly disagree), regarding several stereotypes and beliefs about/within their community. They will then be prompted to discuss their responses. We aim to uncover the diverse beliefs within an individualized group, and to break down stereotypes in the process."
    },
    {
        "background_image": "https://i.ibb.co/fpR0RFx/pathways-cover-large.png",
        "title": "Deconstructing Penn Pathways",
        "subtitle": "Penn student outcomes 😲😲",
        "link": "/deconstructing-penn-pathways",
        "description": "During the spring of 2018, we used student career and internship data provided by Penn Career Services to create a visualization of the different paths that the Class of 2017 pursued over their four years at Penn. In the visualization, bands of varying width represent the number of students that entered a certain field each year. The purpose was to find out what students of each school did at their jobs and summer internships and whether or not preconceptions about the 'most popular industries' were true. The resulting product showed a surprising amount of diversity in the paths chosen by students, with the largest bands in each school being Other, indicating that there are many more students that pursue less mainstream paths than expected. We shared these results with the Penn community in the hopes of providing students with more insight and background while they consider future professional opportunities."
    },
    {
        "background_image": "https://i.ibb.co/7QWPyds/locust-confessions.png",
        "title": "Confessions on Locust",
        "subtitle": "Confesisng on Locust",
        "link": "/confessions",
        "description": "Confessing on Locust I guess?"
    }
]