[
    {
      "description": "A finance major grapples with burnout and hidden passions.",
      "story": "I came to Wharton because I thought I was supposed to. My dad works in private equity, my mom’s in consulting, and I’ve been shadowing investment theses since high school. Sophomore year, I landed a top internship, but every night I lay awake dreading the next day. I told myself it was just the grind—just part of getting ahead.\n\nThen one day, I skipped my accounting recitation to sit in on a poetry workshop. I hadn’t written since middle school, but something clicked. I went back the next week. And the next. I started writing poems about things I never said out loud—about feeling fake in a suit, about losing a friend to mental health, about the weird loneliness in group chats full of people.\n\nNow I go to my interviews and smile. I know how to talk the talk. But I’ve started writing under a pen name, submitting to magazines. I’m not sure what the future looks like, but I know this: there’s more than one way to be successful, and sometimes the path you thought was yours is just noise."
    },
    {
      "description": "An international student finds resilience through rejection and community.",
      "story": "I’m from Mumbai. I came to Wharton wide-eyed, thinking I’d break into Silicon Valley and change the world. First semester, I applied to 12 clubs and got rejected from 10. One interview cut off after 2 minutes. I remember walking back to the Quad in the rain thinking, 'Did I make a mistake coming here?'\n\nBut then something unexpected happened—I went to a cultural potluck hosted by the South Asia Society. No networking, no applications. Just food, music, and people laughing about growing up eating Maggi noodles. I made my first real friends that night. Not résumé friends—real ones. We started cooking together, then studying together, then building a small startup idea just for fun.\n\nTwo years later, I still face rejection. I still sometimes feel like I don’t belong in rooms filled with legacy students and billion-dollar dreams. But I’ve learned that Wharton isn’t just about prestige—it’s about finding your people, embracing failure, and carving your own version of success."
    },
    {
      "description": "A first-gen student redefines what it means to ‘make it.’",
      "story": "I’m the first in my family to go to college, let alone Wharton. My parents run a corner store in Philly and worked 14-hour days to put me through school. When I got in, my mom cried and told me, 'Now you’ll never have to work like we did.'\n\nBut Wharton is intense. People talk about hedge funds like it’s normal. Someone once joked that $200K salaries are 'starter money.' I laughed with them, but it felt like a punch in the gut. There are days I feel like an imposter, like I’m pretending to fit in a world that was never built for me.\n\nStill, I’ve started owning my story. I’m in a mentorship program for first-gen students, and I recently gave a talk about financial literacy in under-resourced schools. When I shared how my dad taught me to save coins in a glass jar and balance the store’s books by hand, kids actually listened.\n\nSuccess used to mean Wall Street. Now, it means helping people like my parents retire early. It means showing younger kids from my neighborhood that they can sit in Huntsman Hall too. Wharton gave me the tools—but my roots give me purpose."
    }
  ]
  